{"id": "7f1d5fa6b5", "source_url": "https://documentation.ubuntu.com/server/how-to/virtualisation/enable-nested-virtualisation/", "title": "How to enable nested virtualisation - Ubuntu Server documentation", "text": "How to enable nested virtualisation - Ubuntu Server documentation\nContents\nMenu\nExpand\nLight mode\nDark mode\nAuto light/dark, in light mode\nAuto light/dark, in dark mode\nSkip to content\nBack to top\nView this page\nHow to enable nested virtualisation\n¶\nImportant\nNested virtualisation is enabled by default on Ubuntu. If you are using Ubuntu, it’s unlikely that you will need to manually enable the feature. If you check (using the steps below) and discover that nested virtualisation is enabled, then you will not need to do anything further.\nThere may be use cases where you need to enable nested virtualisation so that you can deploy instances inside other instances. The sections below explain how to check if nested virtualisation is enabled/available and how to enable it if that is not the case. Bear in mind that currently nested virtualisation is only supported in Ubuntu on\nx86\nmachine architecture.\nCheck if nested virtualisation is enabled\n¶\nCheck if the required kernel module for your CPU is already loaded. Hosts with Intel CPUs require the\nkvm_intel\nmodule while\nAMD\nhosts require\nkvm_amd\ninstead:\n$\nlsmod\n|\ngrep\n-i\nkvm\nkvm_intel\n204800\n0\nkvm\n1347584\n1\nkvm_intel\nIf the module is loaded\n¶\nIf the module is already loaded, you can check if nested virtualisation is enabled by running the following command:\ncat\n/sys/module/<module>/parameters/nested\nAs an example for AMD hosts:\n$\ncat\n/sys/module/kvm_amd/parameters/nested\n1\nIf the output is either\n1\nor\nY\nthen nested virtualisation is enabled and you will not need to manually enable the feature (this should be the case for Ubuntu users).\nIf the module is not loaded\n¶\nIf the module your host requires is not loaded, you can load it using\nmodprobe\nin combination with the property\nnested=1\nto enable nested virtualisation, as shown below for Intel hosts:\nmodprobe\nkvm-intel\nnested\n=\n1\nOr as follows for AMD hosts:\nmodprobe\nkvm-amd\nnested\n=\n1\nEnable nested virtualisation\n¶\nIf the above checks indicate that nested virtualisation is not enabled, you can follow the below steps to enable it.\nCreate a file in\n/etc/modprobe.d\n-e.g.,\n/etc/modprobe.d/kvm.conf\n- and add the line\noptions\nkvm-intel\nnested=1\nto that file (replace\nkvm-intel\nwith\nkvm-amd\nfor AMD hosts).\nReload the kernel module to apply the changes:\nsudo\nmodprobe\n-r\n<module>\nExample for Intel hosts:\nsudo\nmodprobe\n-r\nkvm-intel\nYou should now be able to see nested virtualisation enabled:\nExample for Intel hosts:\n$\ncat\n/sys/module/kvm_intel/parameters/nested\nY\nCheck and enable nested virtualisation inside an instance\n¶\nOnce the host is ready to use nested virtualisation, it is time to check if the guest instance can run additional nested VMs inside it.\nTo determine if an instance can host another instance on top, run the below command within the instance:\negrep\n\"svm|vmx\"\n/proc/cpuinfo\nIf any of these are present in the output (depending on whether the host is AMD or Intel respectively), then virtualisation is available in that instance. If this is not the case you will need to edit the instance CPU settings:\nShut down the instance\nEdit the instance XML definition file executing:\nvirsh\nedit\n<instance>\nSearch the\ncpu\nmode\nparameter in and set its value to either\nhost-model\nor\nhost-passthrough\n(details about these modes can be found\nhere\n).\nSample\ncpu\nmode\nparameter in XML with nested virtualisation:\n<cpu\nmode=\n'host-model'\ncheck=\n'partial'\n/>\nSave the modifications and start the instance\nLimitations of nested virtualisation\n¶\nNested virtualisation has some key limitations you’d need to consider, namely that not all KVM features will be available for instances running nested VMs, and actions such as migrating or saving the parent instance will not be possible until the nested instance is stopped.", "meta": {"site": "documentation.ubuntu.com", "crawl_ts": "2025-11-27T10:38:33Z", "original_len_words": 609}}
{"id": "8cbbcb1c32", "source_url": "https://documentation.ubuntu.com/server/how-to/virtualisation/libvirt/", "title": "Libvirt - Ubuntu Server documentation", "text": "Libvirt - Ubuntu Server documentation\nContents\nMenu\nExpand\nLight mode\nDark mode\nAuto light/dark, in light mode\nAuto light/dark, in dark mode\nSkip to content\nBack to top\nView this page\nLibvirt\n¶\nThe\nlibvirt library\nis used to interface with many different virtualisation technologies. Before getting started with libvirt it is best to make sure your hardware supports the necessary virtualisation extensions for\nKernel-based Virtual Machine (KVM)\n. To check this, enter the following from a terminal prompt:\nkvm-ok\nA message will be printed informing you if your CPU\ndoes\nor\ndoes not\nsupport hardware virtualisation.\nNote\nOn many computers with processors supporting hardware-assisted virtualisation, it is necessary to first activate an option in the BIOS to enable it.\nVirtual networking\n¶\nThere are a few different ways to allow a virtual machine access to the external network. The default virtual network configuration includes\nbridging\nand\niptables\nrules implementing\nusermode\nnetworking, which uses the\nSLiRP\nprotocol. Traffic is NATed through the host interface to the outside network.\nTo enable external hosts to directly access services on virtual machines, a different type of\nbridge\nthan the default needs to be configured. This allows the virtual interfaces to connect to the outside network through the physical interface, making them appear as normal hosts to the rest of the network.\nThere is a great example of\nhow to configure a bridge\nand combine it with libvirt so that guests will use it at the\nnetplan.io documentation\n.\nInstall libvirt\n¶\nTo install the necessary packages, from a terminal prompt enter:\nsudo\napt\nupdate\nsudo\napt\ninstall\nqemu-kvm\nlibvirt-daemon-system\nAfter installing\nlibvirt-daemon-system\n, the user that will be used to manage virtual machines needs to be added to the\nlibvirt\ngroup. This is done automatically for members of the\nsudo\ngroup, but needs to be done in addition for anyone else that should access system-wide libvirt resources. Doing so will grant the user access to the advanced networking options.\nIn a terminal enter:\nsudo\nadduser\n$USER\nlibvirt\nNote\nIf the chosen user is the current user, you will need to log out and back in for the new group membership to take effect.\nYou are now ready to install a\nGuest\noperating system. Installing a virtual machine follows the same process as installing the operating system directly on the hardware.\nYou will need\none\nof the following:\nA way to automate the installation.\nA keyboard and monitor attached to the physical machine.\nTo use cloud images which are meant to self-initialize (see\nMultipass\nand\nUVTool\n).\nIn the case of virtual machines, a\nGraphical User Interface (GUI)\nis analogous to using a physical keyboard and mouse on a real computer. Instead of installing a GUI the\nvirt-viewer\nor\nvirt-manager\napplication can be used to connect to a virtual machine’s console using VNC. See\nVirtual Machine Manager / Viewer\nfor more information.\nVirtual machine management\n¶\nThe following section covers\nvirsh\n, a virtual machine management tool that is a part of libvirt. But there are other tools available at different levels of complexities and feature-sets, like:\nMultipass\nUVTool\nvirt-* tools\nOpenStack\nManage VMs with\nvirsh\n¶\nThere are several utilities available to manage virtual machines and libvirt. The\nvirsh\nutility can be used from the command line. Some examples:\nTo list running virtual machines:\nvirsh\nlist\nTo start a virtual machine:\nvirsh\nstart\n<guestname>\nSimilarly, to start a virtual machine at boot:\nvirsh\nautostart\n<guestname>\nReboot a virtual machine with:\nvirsh\nreboot\n<guestname>\nThe\nstate\nof virtual machines can be saved to a file in order to be restored later. The following will save the virtual machine state into a file named according to the date:\nvirsh\nsave\n<guestname>\nsave-my.state\nOnce saved, the virtual machine will no longer be running.\nA saved virtual machine can be restored using:\nvirsh\nrestore\nsave-my.state\nTo shut down a virtual machine you can do:\nvirsh\nshutdown\n<guestname>\nA CD-ROM device can be mounted in a virtual machine by entering:\nvirsh\nattach-disk\n<guestname>\n/dev/cdrom\n/media/cdrom\nTo change the definition of a guest,\nvirsh\nexposes the domain via:\nvirsh\nedit\n<guestname>\nThis will allow you to edit the\nXML representation that defines the guest\n. When saving, it will apply format and integrity checks on these definitions.\nEditing the XML directly certainly is the most powerful way, but also the most complex one. Tools like\nVirtual Machine Manager / Viewer\ncan help inexperienced users to do most of the common tasks.\nNote\nIf\nvirsh\n(or other\nvir*\ntools) connect to something other than the default\nqemu-kvm\n/system hypervisor, one can find alternatives for the\n--connect\noption using\nman\nvirsh\nor the\nlibvirt docs\n.\nsystem\nand\nsession\nscope\n¶\nYou can pass connection strings to\nvirsh\n- as well as to most other tools for managing virtualisation.\nvirsh\n--connect\nqemu:///system\nThere are two options for the connection.\nqemu:///system\n- connect locally as\nroot\nto the daemon supervising QEMU and KVM domains\nqemu:///session\n- connect locally as a\nnormal user\nto their own set of QEMU and KVM domains\nThe\ndefault\nwas always (and still is)\nqemu:///system\nas that is the behavior most users are accustomed to. But there are a few benefits (and drawbacks) to\nqemu:///session\nto consider.\nqemu:///session\nis per user and can – on a multi-user system – be used to separate the people.\nMost importantly, processes run under the permissions of the user, which means no permission struggle on the just-downloaded image in your\n$HOME\nor the just-attached USB-stick.\nOn the other hand it can’t access system resources very well, which includes network setup that is known to be hard with\nqemu:///session\n. It falls back to\nSLiRP networking\nwhich is functional but slow, and makes it impossible to be reached from other systems.\nqemu:///system\nis different in that it is run by the global system-wide libvirt that can arbitrate resources as needed. But you might need to\nmv\nand/or\nchown\nfiles to the right places and change permissions to make them usable.\nApplications will usually decide on their primary use-case. Desktop-centric applications often choose\nqemu:///session\nwhile most solutions that involve an administrator anyway continue to default to\nqemu:///system\n.\nSee also\nThere is more information about this topic in the\nlibvirt FAQ\nand this\nblog post\nabout the topic.\nMigration\n¶\nThere are different types of migration available depending on the versions of libvirt and the hypervisor being used. In general those types are:\nOffline migration\nLive migration\nPostcopy migration\nThere are various options to those methods, but the entry point for all of them is\nvirsh\nmigrate\n. Read the integrated help for more detail.\nvirsh\nmigrate\n--help\nSome useful documentation on the constraints and considerations of live migration can be found at the\nUbuntu Wiki\n.\nCPU model and topology\n¶\nlibvirt abstracts CPU configuration and provides several options to specify the VM CPU model in the domain definition:\ncustom\nhost-model\nhost-passthrough\nmaximum\nWhile most of thee modes are straightforward, the behavior of\nhost-model\nis more subtle and the source of many common misunderstandings. There is no direct\ntranslation of\nhost-model\ninto a single QEMU\n-cpu\nargument. Instead, libvirt selects a baseline CPU model and appends\na list of features:\n# example snippet from qemu command line generated by libvirt\n...\n-cpu\nHaswell-noTSX-IBRS,vmx\n=\non,pdcm\n=\noff,...,vmx-entry-load-efer\n=\non,vmx-eptp-switching\n=\non\n...\nBecause libvirt can not include every known CPU model and variant, it chooses the model that shares the largest set of features with\nthe host’s physical CPU and then lists the remaining features explicitly. In many cases, libvirt therefore can not detect the\nexact host CPU model. At first this may seem like a flaw, but in practice, it is not necessary to know the exact model.\nFor example, running\nvirsh\ncapabilities\non a host with an Intel\nBroadwell CPU\nmay produce the following output,\nwhere libvirt uses\nHaswell-noTSX-IBRS\nas the baseline:\n<capabilities>\n<host>\n<uuid>\n30303837-3831-584d-5135-323430354a38\n</uuid>\n<cpu>\n<arch>\nx86_64\n</arch>\n<model>\nHaswell-noTSX-IBRS\n</model>\n<vendor>\nIntel\n</vendor>\n<microcode\nversion=\n'73'\n/>\n<signature\nfamily=\n'6'\nmodel=\n'63'\nstepping=\n'2'\n/>\n<counter\nname=\n'tsc'\nfrequency=\n'2397195000'\nscaling=\n'no'\n/>\n<topology\nsockets=\n'1'\ndies=\n'1'\ncores=\n'6'\nthreads=\n'2'\n/>\n<maxphysaddr\nmode=\n'emulate'\nbits=\n'46'\n/>\n<feature\nname=\n'vme'\n/>\n<feature\nname=\n'ds'\n/>\n<feature\nname=\n'acpi'\n/>\n<feature\nname=\n'ss'\n/>\nThis mismatch between the baseline model reported by libvirt and the actual physical CPU model is not a bug and can safely be ignored.\nFor more details, refer to the\nupstream documentation\n.\nHost CPU capabilities\n¶\nDevice passthrough/hotplug\n¶\nIf you want to always pass through a device rather than using the hotplugging method described here, add the XML content of the device to your static guest XML representation via\nvirsh\nedit\n<guestname>\n. In that case, you won’t need to use\nattach/detach\n. There are different kinds of passthrough, and the types available to you depend on your hardware and software setup.\nUSB\nhotplug\n/passthrough\nVF hotplug/Passthrough\nBoth kinds are handled in a very similar way and while there are various way to do it (e.g. also via QEMU monitor), driving such a change via libvirt is recommended. That way, libvirt can try to manage all sorts of special cases for you and also somewhat masks version differences.\nIn general, when driving hotplug via libvirt, you create an XML snippet that describes the device just as you would do in a static\nguest description\n. A USB device is usually identified by vendor/product ID:\n<hostdev\nmode=\n'subsystem'\ntype=\n'usb'\nmanaged=\n'yes'\n>\n<source>\n<vendor\nid=\n'0x0b6d'\n/>\n<product\nid=\n'0x3880'\n/>\n</source>\n</hostdev>\nVirtual functions are usually assigned via their PCI ID (domain, bus, slot, and function).\n<hostdev\nmode=\n'subsystem'\ntype=\n'pci'\nmanaged=\n'yes'\n>\n<source>\n<address\ndomain=\n'0x0000'\nbus=\n'0x04'\nslot=\n'0x10'\nfunction=\n'0x0'\n/>\n</source>\n</hostdev>\nNote\nGetting the virtual function in the first place is very device-dependent and can, therefore, not be fully covered here. But in general, it involves setting up an\nIOMMU\n, registering via\nVFIO\nand sometimes requesting a number of VFs.\nHere is an example of configuring a\nppc64el\nsystem to create four VFs on a device:\n$\nsudo\nmodprobe\nvfio-pci\n# identify device\n$\nlspci\n-n\n-s\n0005\n:01:01.3\n0005\n:01:01.3\n0200\n:\n10df:e228\n(\nrev\n10\n)\n# register and request VFs\n$\necho\n10df\ne228\n|\nsudo\ntee\n/sys/bus/pci/drivers/vfio-pci/new_id\n$\necho\n4\n|\nsudo\ntee\n/sys/bus/pci/devices/0005\n\\:\n01\n\\:\n00\n.0/sriov_numvfs\nYou then attach or detach the device via libvirt by relating the guest with the XML snippet.\nvirsh\nattach-device\n<guestname>\n<device-xml>\n# Use the Device in the Guest\nvirsh\ndetach-device\n<guestname>\n<device-xml>\nAccess QEMU Monitor via libvirt\n¶\nThe\nQEMU Monitor\nis the way to interact with QEMU/KVM while a guest is running. This interface has many powerful features for experienced users. When running under libvirt, the monitor interface is bound by libvirt itself for management purposes, but a user can still run QEMU monitor commands via libvirt. The general syntax is\nvirsh\nqemu-monitor-command\n[options]\n[guest]\n'command'\n.\nLibvirt covers most use cases needed, but if you ever want/need to work around libvirt or want to tweak very special options you can e.g. add a device as follows:\nvirsh\nqemu-monitor-command\n--hmp\nfocal-test-log\n'drive_add 0 if=none,file=/var/lib/libvirt/images/test.img,format=raw,id=disk1'\nThe monitor is a power tool, especially for debugging purposes. For example, one can use the monitor to show the guest registers:\n$\nvirsh\nqemu-monitor-command\n--hmp\ny-ipns\n'info registers'\nRAX\n=\n00ffffc000000000\nRBX\n=\nffff8f0f5d5c7e48\nRCX\n=\n0000000000000000\nRDX\n=\nffffea00007571c0\nRSI\n=\n0000000000000000\nRDI\n=\nffff8f0fdd5c7e48\nRBP\n=\nffff8f0f5d5c7e18\nRSP\n=\nffff8f0f5d5c7df8\n[\n...\n]\nHuge pages\n¶\nLet’s start with a summary of the allocation and structuring of memory in an OS, and its relationship to transparent huge pages and\nhuge pages\n.\nWhen you launch an application, the OS allocates virtual memory to it as a range of virtual addresses. The virtual memory is fake; it only allows the application to think it has more memory than what’s physically available.\nHowever, the CPU architecture will determine the amount of virtual memory allocated to the application;\n64-bit CPUs\nsupport 16 EB, whereas\n32-bit CPUs\nsupport 4 GB.\nx86_64\n, however, typically supports only 256 TB of virtual memory.\nThe OS splits the virtual memory into pages (4 KB each). A page contains several virtual addresses (\n1 byte each\n). These pages contain different parts of the application, like the code, data, stack, and heap. The OS maps these pages to real memory (RAM) because the virtual memory is a fake.\nAlthough the OS allocates the virtual memory, the range of virtual addresses is generated by the CPU whenever the application accesses memory (e.g., reading a variable, fetching an instruction, or writing data). The\nMemory Management Unit (MMU)\nreceives these virtual addresses and uses the page table to convert them into physical addresses.\nWith a 4 KB page size in the table, a large application having 200 MB in size, for example, could have thousands of pages. So, constantly looking up the page table in RAM would be slow. To briefly fix this, the CPU uses a\nTranslation Lookaside Buffer (TLB)\nto cache recent page table entries to speed up memory access; however, the TLB can only hold a certain number of entries.\nTo reduce this overhead, you can use huge pages, which increase the page size from 4 KB to larger sizes (e.g., 2 MB or 1 GB). This reduces the number of page table entries in the TLB, making lookups faster.\nHuge pages must frequently be\npre-allocated\non the host for Libvirt to\nmap the VMs memory to the host\n. This is because VMs rely on two layers of address translation — one for the VM and one for the host - so expect memory lookups to be CPU-intensive.\nSince huge pages can be configured on Libvirt, the page table entries are reduced, hence, memory access from the VM speeds up.\nIt’s now clear how huge pages can lessen page table entries and TLB overhead.\nHuge pages can have some disadvantages too, as they frequently require manual setup. To address this,\ntransparent huge pages\nare used to manage pages dynamically.\nThe dynamic page resizing can also be an issue when using libvirt since huge pages have to be pre-allocated. So, if it is clear that using huge pages is preferred, then making them explicit usually has some gains.\nWhile huge pages are admittedly harder to manage (especially later in the system’s lifetime if memory is fragmented), they provide a useful boost, especially for rather large guests.\nTip\nWhen using device passthrough on very large guests, there is an extra benefit of using huge pages, as it is faster to do the initial memory clear on the VFIO\nDMA\npin.\nHuge page allocation\n¶\nHuge pages come in different sizes. A\nnormal\npage is usually 4k and huge pages are either 2M or 1G, but depending on the architecture, other options are possible.\nThe simplest yet least reliable way to allocate some huge pages is to just echo a value to\nsysfs\n:\necho\n256\n|\nsudo\ntee\n/sys/kernel/mm/hugepages/hugepages-2048kB/nr_hugepages\nBe sure to re-check if it worked:\n$\ncat\n/sys/kernel/mm/hugepages/hugepages-2048kB/nr_hugepages\n256\nThere one of these sizes is the “default huge page size”, which will be used in the auto-mounted\n/dev/hugepages\n. Changing the default size requires a reboot and is set via\ndefault_hugepagesz\n.\nYou can check the current default size:\n$\ngrep\nHugepagesize\n/proc/meminfo\n\nHugepagesize:\n2048\nkB\nBut there can be more than one at the same time – so it’s a good idea to check:\n$\ntail\n/sys/kernel/mm/hugepages/hugepages-*/nr_hugepages\n`\n==\n>\n/sys/kernel/mm/hugepages/hugepages-1048576kB/nr_hugepages\n<\n==\n0\n==\n>\n/sys/kernel/mm/hugepages/hugepages-2048kB/nr_hugepages\n<\n==\n2\nAnd even that could – on bigger systems – be further split per\nNuma node\n.\nOne can allocate huge pages at\nboot or runtime\n, but due to fragmentation there are no guarantees it works later. The\nkernel documentation\nlists details on both ways.\nHuge pages need to be allocated by the kernel as mentioned above, but to be consumable, they also have to be mounted. By default,\nsystemd\nwill make\n/dev/hugepages\navailable for the default huge page size.\nFeel free to add more mount points if you need different sized ones. An overview can be queried with\nhugeadm\n:\n$\napt\ninstall\nlibhugetlbfs-bin\n$\nhugeadm\n--list-all-mounts\n\nMount\nPoint\nOptions\n/dev/hugepages\nrw,relatime,pagesize\n=\n2M\nA one-stop info for the overall huge page status of the system can be reported with:\nhugeadm\n--explain\nHuge page usage in libvirt\n¶\nWith the above in place, libvirt can map guest memory to huge pages. In a guest definition add the most simple form of:\n<memoryBacking>\n<hugepages/>\n</memoryBacking>\nThat will allocate the huge pages using the default huge page size from an autodetected mount point.\nFor more control, e.g. how memory is spread over\nNuma nodes\nor which page size to use, check out the details at the\nlibvirt docs\n.\nControlling addressing bits\n¶\nThis is a topic that rarely matters on a single computer with virtual machines for generic use; libvirt will automatically use the hypervisor default, which in the case of QEMU is 40 bits. This default aims for compatibility since it will be the same on all systems, which simplifies migration between them and usually is compatible even with older hardware.\nHowever, it can be very important when driving more advanced use cases. If one needs bigger guest sizes with more than a terabyte of memory then controlling the addressing bits is crucial.\n-hpb machine types\n¶\nSince Ubuntu 18.04, the QEMU in Ubuntu has\nprovided special machine-types\n. These include machine types like\npc-q35-jammy\nor\npc-i440fx-jammy\n, but with a\n-hpb\nsuffix. The “\nHPB\n” abbreviation stands for “host-physical-bits”, which is the QEMU option that this represents.\nFor example, by using\npc-q35-jammy-hpb\n, the guest would use the number of physical bits that the Host CPU has available.\nProviding the configuration that a guest should use more address bits as a machine type has the benefit that many higher level management stacks like for example openstack, are already able to control it through libvirt.\nOne can check the bits available to a given CPU via the procfs:\n$\ncat\n/proc/cpuinfo\n|\ngrep\n'^address sizes'\n...\n# an older server with a E5-2620\naddress\nsizes\n:\n46\nbits\nphysical,\n48\nbits\nvirtual\n# a laptop with an i7-8550U\naddress\nsizes\n:\n39\nbits\nphysical,\n48\nbits\nvirtual\nmaxphysaddr guest configuration\n¶\nSince libvirt version 8.7.0 (>= Ubuntu 22.10 Lunar),\nmaxphysaddr\ncan be controlled via the\nCPU model and topology section\nof the guest configuration.\nIf one needs just a large guest, like before when using the\n-hpb\ntypes, all that is needed is the following libvirt guest xml configuration:\n<maxphysaddr\nmode=\n'passthrough'\n/>\nSince libvirt 9.2.0 and 9.3.0 (>= Ubuntu 23.10 Mantic), an explicit number of emulated bits or a limit to the passthrough can be specified. Combined, this pairing can be very useful for computing clusters where the CPUs have different hardware physical addressing\nbits. Without these features, guests could be large, but potentially unable to migrate freely between all nodes since not all systems would support the same amount of addressing bits.\nBut now, one can either set a fixed value of addressing bits:\n<maxphysaddr\nmode=\n'emulate'\nbits=\n'42'\n/>\nOr use the best available by a given hardware, without going over a certain limit to retain some compute node compatibility.\n<maxphysaddr\nmode=\n'passthrough'\nlimit=\n'41/\n>\nAppArmor isolation\n¶\nBy default, libvirt will spawn QEMU guests using AppArmor isolation for enhanced security. The\nAppArmor rules for a guest\nwill consist of multiple elements:\nA static part that all guests share =>\n/etc/apparmor.d/abstractions/libvirt-qemu\nA dynamic part created at guest start time and modified on hotplug/unplug =>\n/etc/apparmor.d/libvirt/libvirt-f9533e35-6b63-45f5-96be-7cccc9696d5e.files\nOf the above, the former is provided and updated by the\nlibvirt-daemon\npackage, and the latter is generated on guest start. Neither of the two should be manually edited. They will, by default, cover the vast majority of use cases and work fine. But there are certain cases where users either want to:\nFurther lock down the guest, e.g. by explicitly denying access that usually would be allowed.\nOpen up the guest isolation. Most of the time this is needed if the setup on the local machine does not follow the commonly used paths.\nTo do so there are two files. Both are local overrides which allow you to modify them without getting them clobbered or command file prompts on package upgrades.\n/etc/apparmor.d/local/abstractions/libvirt-qemu\nThis will be applied to every guest. Therefore it is a rather powerful (if blunt) tool. It is a quite useful place to add additional\ndeny rules\n.\n/etc/apparmor.d/local/usr.lib.libvirt.virt-aa-helper\nThe above-mentioned\ndynamic part\nthat is individual per guest is generated by a tool called\nlibvirt.virt-aa-helper\n. That is under AppArmor isolation as well. This is most commonly used if you want to use uncommon paths as it allows one to have those uncommon paths in the\nguest XML\n(see\nvirsh\nedit\n) and have those paths rendered to the per-guest dynamic rules.\nSharing files between Host<->Guest\n¶\nTo be able to exchange data, the memory of the guest has to be allocated as “shared”. To do so you need to add the following to the guest config:\n<memoryBacking>\n<access\nmode=\n'shared'\n/>\n</memoryBacking>\nFor performance reasons (it helps\nvirtiofs\n, but also is generally wise to consider) it\nis recommended to use huge pages which then would look like:\n<memoryBacking>\n<hugepages>\n<page\nsize=\n'2048'\nunit=\n'KiB'\n/>\n</hugepages>\n<access\nmode=\n'shared'\n/>\n</memoryBacking>\nIn the guest definition, one then can add\nfilesystem\nsections to specify host paths to share with the guest. The\ntarget dir\nis a bit special as it isn’t really a directory – instead, it is a\ntag\nthat in the guest can be used to access this particular\nvirtiofs\ninstance.\n<filesystem\ntype=\n'mount'\naccessmode=\n'passthrough'\n>\n<driver\ntype=\n'virtiofs'\n/>\n<source\ndir=\n'/var/guests/h-virtiofs'\n/>\n<target\ndir=\n'myfs'\n/>\n</filesystem>\nAnd in the guest, this can now be used based on the tag\nmyfs\nlike:\nsudo\nmount\n-t\nvirtiofs\nmyfs\n/mnt/\nCompared to other Host/Guest file sharing options – commonly Samba, NFS, or 9P –\nvirtiofs\nis usually much faster and also more compatible with usual file system semantics.\nSee the\nlibvirt domain/filesystem\ndocumentation for further details on these.\nNote\nWhile\nvirtiofs\nworks with >=20.10 (Groovy), with >=21.04 (Hirsute) it became more comfortable, especially in small environments (no hard requirement to specify guest Numa topology, no hard requirement to use huge pages). If needed to set up on 20.10 or just interested in those details - the libvirt\nknowledge-base about virtiofs\nholds more details about these.\nResources\n¶\nSee the\nKVM home page\nfor more details.\nFor more information on libvirt see the\nlibvirt home page\n.\nXML configuration of\ndomains\nand\nstorage\nare the most often used libvirt reference.\nAnother good resource is the\nUbuntu Wiki KVM\npage.\nFor basics on how to assign VT-d devices to QEMU/KVM, please see the\nlinux-kvm\npage.\nIntroduction to Memory Management in Linux", "meta": {"site": "documentation.ubuntu.com", "crawl_ts": "2025-11-27T10:38:33Z", "original_len_words": 3829}}
{"id": "00781582ac", "source_url": "https://documentation.ubuntu.com/server/how-to/virtualisation/multipass/", "title": "How to create a VM with Multipass - Ubuntu Server documentation", "text": "How to create a VM with Multipass - Ubuntu Server documentation\nContents\nMenu\nExpand\nLight mode\nDark mode\nAuto light/dark, in light mode\nAuto light/dark, in dark mode\nSkip to content\nBack to top\nView this page\nHow to create a VM with Multipass\n¶\nMultipass\nis the recommended method for creating Ubuntu VMs on Ubuntu. It’s designed for developers who want a fresh Ubuntu environment with a single command, and it works on Linux, Windows and macOS.\nOn Linux it’s available as a snap:\nsudo\nsnap\ninstall\nmultipass\nIf you’re running an older version of Ubuntu where\nsnapd\nisn’t pre-installed, you will need to install it first:\nsudo\napt\nupdate\nsudo\napt\ninstall\nsnapd\nFind available images\n¶\nTo find available images you can use the\nmultipass\nfind\ncommand, which will produce a list like this:\nImage                       Aliases           Version          Description\nsnapcraft:core18            18.04             20201111         Snapcraft builder for Core 18\nsnapcraft:core20            20.04             20210921         Snapcraft builder for Core 20\nsnapcraft:core22            22.04             20220426         Snapcraft builder for Core 22\nsnapcraft:devel                               20221128         Snapcraft builder for the devel series\ncore                        core16            20200818         Ubuntu Core 16\ncore18                                        20211124         Ubuntu Core 18\n18.04                       bionic            20221117         Ubuntu 18.04 LTS\n20.04                       focal             20221115.1       Ubuntu 20.04 LTS\n22.04                       jammy,lts         20221117         Ubuntu 22.04 LTS\n22.10                       kinetic           20221101         Ubuntu 22.10\ndaily:23.04                 devel,lunar       20221127         Ubuntu 23.04\nappliance:adguard-home                        20200812         Ubuntu AdGuard Home Appliance\nappliance:mosquitto                           20200812         Ubuntu Mosquitto Appliance\nappliance:nextcloud                           20200812         Ubuntu Nextcloud Appliance\nappliance:openhab                             20200812         Ubuntu openHAB Home Appliance\nappliance:plexmediaserver                     20200812         Ubuntu Plex Media Server Appliance\nanbox-cloud-appliance                         latest           Anbox Cloud Appliance\ncharm-dev                                     latest           A development and testing environment for charmers\ndocker                                        latest           A Docker environment with Portainer and related tools\njellyfin                                      latest           Jellyfin is a Free Software Media System that puts you in control of managing and streaming your media.\nminikube                                      latest           minikube is local Kubernetes\nLaunch a fresh instance of the Ubuntu Jammy (22.04) LTS\n¶\nYou can launch a fresh instance by specifying either the image name from the list (in this example, 22.04) or using an alias, if the image has one.\n$\nmultipass\nlaunch\n22\n.04\nLaunched:\ncleansing-guanaco\nThis command is equivalent to:\nmultipass\nlaunch\njammy\nor\nmultipass\nlaunch\nlts\nin the list above. It will launch an instance based on the specified image, and provide it with a random name – in this case,\ncleansing-guanaco\n.\nCheck out the running instances\n¶\nYou can check out the currently running instance(s) by using the\nmultipass\nlist\ncommand:\n$\nmultipass\nlist\nName\nState\nIPv4\nImage\ncleansing-guanaco\nRunning\n10\n.140.26.17\nUbuntu\n22\n.04\nLTS\nLearn more about the VM instance you just launched\n¶\nYou can use the\nmultipass\ninfo\ncommand to find out more details about the VM instance parameters:\n$\nmultipass\ninfo\ncleansing-guanaco\nName:\ncleansing-guanaco\nState:\nRunning\nIPv4:\n10\n.140.26.17\nRelease:\nUbuntu\n22\n.04.1\nLTS\nImage\nhash:\ndc5b5a43c267\n(\nUbuntu\n22\n.04\nLTS\n)\nLoad:\n0\n.45\n0\n.19\n0\n.07\nDisk\nusage:\n1\n.4G\nout\nof\n4\n.7G\nMemory\nusage:\n168\n.3M\nout\nof\n969\n.5M\nMounts:\n--\nConnect to a running instance\n¶\nTo enter the VM you created, use the\nshell\ncommand:\n$\nmultipass\nshell\ncleansing-guanaco\nWelcome\nto\nUbuntu\n22\n.04.1\nLTS\n(\nGNU/Linux\n5\n.15.0-53-generic\nx86_64\n)\n(\n...\n)\nubuntu@cleansing-guanaco:~$\nDisconnect from the instance\n¶\nDon’t forget to log out (or\nCtrl\n+\nD\n) when you are done, or you may find yourself heading all the way down the Inception levels…\nRun commands inside an instance from outside\n¶\n$\nmultipass\nexec\ncleansing-guanaco\n--\nlsb_release\n-a\nNo\nLSB\nmodules\nare\navailable.\nDistributor\nID:\nUbuntu\nDescription:\nUbuntu\n22\n.04.1\nLTS\nRelease:\n22\n.04\nCodename:\njammy\nStop or start an instance\n¶\nYou can stop an instance to save resources using the\nstop\ncommand:\n$\nmultipass\nstop\ncleansing-guanaco\nYou can start it back up again using the\nstart\ncommand:\n$\nmultipass\nstart\ncleansing-guanaco\nDelete the instance\n¶\nOnce you are finished with the instance, you can delete it as follows:\n$\nmultipass\ndelete\ncleansing-guanaco\nIt will now show up as deleted when you use the\nlist\ncommand:\n$\nmultipass\nlist\nName\nState\nIPv4\nImage\ncleansing-guanaco\nDeleted\n--\nNot\nAvailable\nAnd when you want to completely get rid of it (and any other deleted instances), you can use the\npurge\ncommand:\n$\nmultipass\npurge\nWhich we can check again using\nlist\n:\n$\nmultipass\nlist\nNo\ninstances\nfound.\nIntegrate with the rest of your virtualisation\n¶\nIf you already have a hypervisor interacting with\nLibvirt\n, such as\nQEMU\n,\nKVM\n, or\nESXi\n, you might\nbe managing virtual machines through tools like\nvirt-manager\nor the older\nuvtool\n.\nIn that case, integrating Multipass with your existing setup would allow VMs to share the same network bridge for communication\nand be managed using virsh. However, Multipass runs as a headless system, so you don’t have direct GUI access through virt-viewer. Follow this\nguide\nto set up a GUI.\nTo begin, integrate Multipass into your existing setup by selecting libvirt as your local driver:\n$\nsudo\nmultipass\nset\nlocal.driver\n=\nlibvirt\nNote\nIf you are having issues interacting with Multipass after switching to the libvirt driver, check if there is a restriction by\nAppArmor\n, for example. AppArmor may have a default policy which restricts the multipass service from interacting with the\nlibvert service\n. So you need to add an explicit permission that allows it.\nStart a guest, and access it via tools like\nvirt-manager\nor\nvirsh\n:\n$\nmultipass\nlaunch\nlts\nLaunched:\nengaged-amberjack\n\n$\nvirsh\nlist\nId\nName\nState\n----------------------------------------------------\n15\nengaged-amberjack\nrunning\nFor more detailed and comprehensive instructions on changing your drivers, refer to the\nMultipass drivers documentation\n.\nGet help\n¶\nYou can use the following commands on the CLI:\nmultipass\nhelp\nmultipass\nhelp\n<command>\nmultipass\nhelp\n--all\nOr, check out the\nMultipass documentation\nfor more details on how to use it.", "meta": {"site": "documentation.ubuntu.com", "crawl_ts": "2025-11-27T10:38:33Z", "original_len_words": 958}}
{"id": "5e21bca42c", "source_url": "https://documentation.ubuntu.com/server/how-to/virtualisation/qemu/", "title": "QEMU - Ubuntu Server documentation", "text": "QEMU - Ubuntu Server documentation\nContents\nMenu\nExpand\nLight mode\nDark mode\nAuto light/dark, in light mode\nAuto light/dark, in dark mode\nSkip to content\nBack to top\nView this page\nQEMU\n¶\nNote\nPlease bear in mind that invoking QEMU manually may sometimes require your user to be part of the\nkvm\ngroup.\nVirtualisation with QEMU\n¶\nQEMU\nis a machine emulator that can run operating systems and programs for one machine on a different machine. However, it is more often used as a virtualizer in collaboration with\nKVM\nkernel components. In that case it uses the hardware virtualization technology to virtualize guests.\nAlthough QEMU has a\ncommand line interface\nand a\nmonitor\nto interact with running guests, they are typically only used for development purposes. On the other hand,\nlibvirt\nprovides an abstraction from specific versions and hypervisors, and encapsulates some workarounds and best practices.\nInstall QEMU/KVM\n¶\nThe first step to using QEMU/KVM on Ubuntu is to check if your system supports KVM.\nkvm-ok\nYou should get an output saying\nKVM\nacceleration\ncan\nbe\nused\n.\nThe next step is to install QEMU.\nsudo\napt-get\ninstall\nqemu-system\nBoot a VM\n¶\nThe quickest way to get started with QEMU is by booting a VM directly from a netboot ISO. You can achieve this by running the following command:\nqemu-system-x86_64\n-enable-kvm\n-cdrom\nhttp://archive.ubuntu.com/ubuntu/dists/bionic-updates/main/installer-amd64/current/images/netboot/mini.iso\nCaution\nThis example is just for illustration purposes - it is not generally recommended without verifying the checksums;\nMultipass\nand\nUVTool\nare much better ways to get actual guests easily.\nIf you are testing this example on a headless system, specify an alternative display method such as\nVNC\n.\nCreate a virtual disk\n¶\nThe command in the previous sub-section boots the system entirely in RAM without persistent storage. To maintain the OS state across reboots, you should allocate space for the VM:\nqemu-img\ncreate\n-f\nqcow2\ndisk.qcow\n5G\nAnd then we can use the disk space we have just allocated for storage by adding the argument:\n-drive\nfile=disk.qcow,format=qcow2\n.\nThese tools can do much more, as you’ll discover in their respective (long)\nmanpages\n. They can also be made more consumable for specific use-cases and needs through a vast selection of auxiliary tools - for example\nvirt-manager\nfor UI-driven use through\nlibvirt\n. But in general, it comes down to:\nqemu-system-x86_64\noptions\nimage\n[\ns\n]\nSo take a look at the\nQEMU manpage\n,\nqemu-img(1)\nand the\nQEMU documentation\nand see which options best suit your needs.\nWhile a standard QEMU configuration works for most use cases, some scenarios demand high-vCPU VMs. In the next section, we’ll cover how to create QEMU virtual machines with up to 1024 vCPUs.\nCreate QEMU VMs with up to 1024 vCPUs\n¶\nFor a long time, QEMU only supported launching virtual machines with 288 vCPUs or fewer. While this was acceptable a decade ago, nowadays it is more common to see processors with 300+ physical cores available. For this reason, QEMU has been modified to support virtual machines with up to 1024 vCPUs. The caveat is that the user has to provide a few specific (and not trivial to guess) command line options to enable such a feature, and that is the gap that this document aims to fill.\nRequirement\n¶\nTo support more than 288 vCPUs, some QEMU versions are only compatible with special machine types.\nQEMU version\nUbuntu release\nSupported machine types\nQEMU 8.2.1+\nUbuntu 24.04 LTS (Noble)\nubuntu\n(Native support, also supports Jammy and Mantic machine types)\nQEMU 8.0.4\nUbuntu 23.10 (Mantic)\npc-q35-mantic-maxcpus\n,\npc-i440fx-mantic-maxcpus\n(Also supports Jammy machine types)\nQEMU 6.2\nUbuntu 22.04 LTS (Jammy)\npc-q35-jammy-maxcpus\n,\npc-i440fx-jammy-maxcpus\nConfiguration by Ubuntu release\n¶\n24.04 Noble\nFrom Noble onwards, the regular\nubuntu\nmachine type supports up to 1024 vCPUs out of the box, which simplifies the command used to create such virtual machines:\nqemu\n-\nsystem\n-\nx86_64\n-\nM\nubuntu\n,\naccel\n=\nkvm\n,\nkernel\n-\nirqchip\n=\nsplit\n-\ndevice\nintel\n-\niommu\n,\nintremap\n=\non\n-\nsmp\ncpus\n=\n300\n,\nmaxcpus\n=\n300\n...\nAlthough the regular machine type can now be used to launch the virtual machine, it is still necessary to provide some special command line options to make sure that the VM is created with a virtual IOMMU with interrupt mapping.\nNow that we’ve covered high-vCPU configurations for x86_64 VMs, let’s look at how to boot ARM64 virtual machines on QEMU.\n23.10 Mantic\nIf you are using QEMU on Mantic, the special machine types are named in a similar fashion to Jammy’s:\npc-q35-mantic-maxcpus\nor\npc-i440fx-mantic-maxcpus\n.\nTherefore, you command line to create a virtual machine with support for more than 288 vCPUs on Mantic should start with:\nqemu\n-\nsystem\n-\nx86_64\n-\nM\npc\n-\nq35\n-\nmantic\n-\nmaxcpus\n,\naccel\n=\nkvm\n,\nkernel\n-\nirqchip\n=\nsplit\n-\ndevice\nintel\n-\niommu\n,\nintremap\n=\non\n-\nsmp\ncpus\n=\n300\n,\nmaxcpus\n=\n300\n...\nIn the example above, the virtual machine will be launched using 300 vCPUs and a\npc-q35-mantic-maxcpus\nmachine type. You can adjust the option according to your use case.\nThe\nkernel-irqchip=split\n-device\nintel-iommu,intremap=on\ncommand line options are required, to make sure that the VM is created with a virtual IOMMU with interrupt mapping. This is needed due to some idiosyncrasies present in this scenario.\nNote that both machine types for Mantic are supported in subsequent versions of Ubuntu, so you should be able to migrate your virtual machines to newer versions of QEMU in Ubuntu without problems. As noted in the previous section, it is also possible to create virtual machines using the special Jammy machine types on Mantic.\n22.04 Jammy\nIf you are using QEMU on Jammy and want to create VMs with more than 288 vCPUs, you will need to use either of the special\npc-q35-jammy-maxcpus\nor\npc-i440fx-jammy-maxcpus\nmachine types.\nThe command line needs to start with:\nqemu\n-\nsystem\n-\nx86_64\n-\nM\npc\n-\nq35\n-\njammy\n-\nmaxcpus\n,\naccel\n=\nkvm\n,\nkernel\n-\nirqchip\n=\nsplit\n-\ndevice\nintel\n-\niommu\n,\nintremap\n=\non\n-\nsmp\ncpus\n=\n300\n,\nmaxcpus\n=\n300\n...\nIn the example above, the virtual machine will be launched using 300 vCPUs and a\npc-q35-jammy-maxcpus\nmachine type. You can adjust the option according to your use case.\nThe\nkernel-irqchip=split\n-device\nintel-iommu,intremap=on\ncommand line options are required, to make sure that the VM is created with a virtual IOMMU with interrupt mapping. This is needed due to some idiosyncrasies present in this scenario.\nNote that both machine types for Jammy are supported in subsequent versions of Ubuntu, so you should be able to migrate your virtual machines to newer versions of QEMU in Ubuntu without problems.\nBoot ARM64 virtual machines on QEMU\n¶\nUbuntu ARM64 images can run inside QEMU. You can either do this fully emulated (e.g. on an x86 host) or accelerated with KVM if you have an ARM64 host. This page describes how to do both.\nNote\nThis requires Ubuntu 20.04 or greater\nInstall QEMU to run ARM64 virtual machines\n¶\nThe first step is to install the\nqemu-system-arm\npackage, which needs to be done regardless of where the ARM64 virtual machine will run:\nsudo\napt\ninstall\nqemu-system-arm\nCreate necessary support files\n¶\nNext, create a VM-specific flash volume for storing NVRAM variables, which are necessary when booting\nEFI\nfirmware:\ntruncate\n-s\n64m\nvarstore.img\nWe also need to copy the ARM UEFI firmware into a bigger file:\ntruncate\n-s\n64m\nefi.img\ndd\nif\n=\n/usr/share/qemu-efi-aarch64/QEMU_EFI.fd\nof\n=\nefi.img\nconv\n=\nnotrunc\nFetch the Ubuntu cloud image\n¶\nYou need to fetch the ARM64 variant of the Ubuntu cloud image you would like to use in the virtual machine. You can go to the official\nUbuntu cloud image\nwebsite, select the Ubuntu release, and then download the variant whose filename ends in\n-arm64.img\n. For example, if you want to use the latest Jammy cloud image, you should download the file named\njammy-server-cloudimg-arm64.img\n.\nRun QEMU natively on an ARM64 host\n¶\nIf you have access to an ARM64 host, you should be able to create and launch an ARM64 virtual machine there. Note that the command below assumes that you have already set up a network bridge to be used by the virtual machine.\nqemu-system-aarch64\n\\\n-enable-kvm\n\\\n-m\n1024\n\\\n-cpu\nhost\n\\\n-M\nvirt\n\\\n-nographic\n\\\n-drive\nif\n=\npflash,format\n=\nraw,file\n=\nefi.img,readonly\n=\non\n\\\n-drive\nif\n=\npflash,format\n=\nraw,file\n=\nvarstore.img\n\\\n-drive\nif\n=\nnone,file\n=\njammy-server-cloudimg-arm64.img,id\n=\nhd0\n\\\n-device\nvirtio-blk-device,drive\n=\nhd0\n-netdev\ntype\n=\ntap,id\n=\nnet0\n\\\n-device\nvirtio-net-device,netdev\n=\nnet0\nRun an emulated ARM64 VM on x86\n¶\nYou can also emulate an ARM64 virtual machine on an x86 host. To do that:\nqemu-system-aarch64\n\\\n-m\n2048\n\\\n-cpu\nmax\n\\\n-M\nvirt\n\\\n-nographic\n\\\n-drive\nif\n=\npflash,format\n=\nraw,file\n=\nefi.img,readonly\n=\non\n\\\n-drive\nif\n=\npflash,format\n=\nraw,file\n=\nvarstore.img\n\\\n-drive\nif\n=\nnone,file\n=\njammy-server-cloudimg-arm64.img,id\n=\nhd0\n\\\n-device\nvirtio-blk-device,drive\n=\nhd0\n\\\n-netdev\ntype\n=\ntap,id\n=\nnet0\n\\\n-device\nvirtio-net-device,netdev\n=\nnet0\nTroubleshooting\n¶\nNo output and no response\n¶\nIf you get no output from the QEMU command above, aligning your host and guest release versions may help. For example, if you generated\nefi.img\non Focal but want to emulate Jammy (with the Jammy cloud image), the firmware may not be fully compatible. Generating\nefi.img\non Jammy when emulating Jammy with the Jammy cloud image may help.\nFurther reading\n¶\nQEMU can be extended in many different ways. If you’d like to take QEMU further, you might want to explore these additional resources:\nVirtualizing graphics using QEMU/KVM\nUsing QEMU to create a microvm\n.", "meta": {"site": "documentation.ubuntu.com", "crawl_ts": "2025-11-27T10:38:34Z", "original_len_words": 1626}}
{"id": "e453532c0b", "source_url": "https://documentation.ubuntu.com/server/how-to/virtualisation/sev-snp/", "title": "Confidential Computing with AMD - Ubuntu Server documentation", "text": "Confidential Computing with AMD - Ubuntu Server documentation\nContents\nMenu\nExpand\nLight mode\nDark mode\nAuto light/dark, in light mode\nAuto light/dark, in dark mode\nSkip to content\nBack to top\nView this page\nConfidential Computing with AMD\n¶\nSecure Encrypted Virtualization - Secure Nested Paging (SEV-SNP) are a set of virtualization features available on the latest AMD EPIC CPUs (starting from “Rome”). These features enable\nConfidential Computing\nwhich is a way to better isolate a workload from the hypervisor and the host Operating System.\nVirtual Machines launched with SEV-SNP features enabled have their CPU registers protected from the host OS and their memory encrypted and integrity protected. The memory protection relies on the CPU’s Memory Management Unit (MMU) which verifies the integrity of the secure pages and generates per-VM encryption keys to encrypt them and prevent the host OS from reading their content.\nWhile using Ubuntu as a guest OS on SEV-SNP VMs has been supported since Ubuntu 24.04 LTS, the host enablement (QEMU and OVMF support) was only added later with Ubuntu 25.04.\nHost configuration\n¶\nAMD SEV-SNP is fully supported as of Ubuntu 25.04. To launch a VM with these features, enable memory encryption features and SNP in the firmware settings, and then assign Address-Space Identifiers (ASIDs) to SNP. For more details, refer to\nAMD’s documentation\nand to the manuals for your specific mainboard or Baseboard Management Controller (BMC).\nOn the host OS, install\nqemu-system-x86_64\nand launch QEMU with the following parameters:\nqemu-system-x86_64\n\\\n-enable-kvm\n\\\n-nographic\n\\\n-machine\nq35\n-smp\n6\n-m\n6G\n\\\n-drive\n\"if=virtio,format=qcow2,file=disk.img\"\n\\\n-net\nnic,model\n=\ne1000\n-net\nuser,hostfwd\n=\ntcp::2222-:22\n\\\n-cpu\nEPYC-v4\n\\\n-machine\nmemory-encryption\n=\nsev0,vmport\n=\noff\n\\\n-object\nmemory-backend-memfd,id\n=\nram1,size\n=\n6G,share\n=\ntrue,prealloc\n=\nfalse\n\\\n-machine\nmemory-backend\n=\nram1\n\\\n-object\nsev-snp-guest,id\n=\nsev0,cbitpos\n=\n47\n,reduced-phys-bits\n=\n1\n,kernel-hashes\n=\non\n\\\n-kernel\n./vmlinuz\n\\\n-append\n\"root=/dev/vda1 console=ttyS0\"\n\\\n-bios\n/usr/share/ovmf/OVMF.amdsev.fd\nHere we are configuring the VM to use 6GB of encrypted memory:\ncbitpos\nand\nreduced-phys-bits\nhave to be\n47\nand\n1\nrespectively for all EPYC CPUs.\nkernel-hashes=on\nmakes sure the kernel, initramfs and command line will be measured during the launch. It can be disabled but if enabled, the kernel needs to be provided with\n-kernel\nOVMF.amdsev.fd\nis a specific version of\nEDK II\n.\nFor more details about these parameters, refer to QEMU documentation pages for\ninvocation\nand\nAMD SEV\n.\nGuest configuration\n¶\nOn the guest side, Ubuntu 24.04 LTS and newer fully support AMD SEV-SNP. You can download the disk image and kernel for your VM from\ncloud-images.ubuntu.com\n. The latest image and kernel can be found here:\nhttps://cloud-images.ubuntu.com/releases/noble/release/ubuntu-24.04-server-cloudimg-amd64.img\nhttps://cloud-images.ubuntu.com/releases/noble/release/unpacked/\nOnce the VM is launched, install\nlinux-generic\nto get the\nsev-guest\nmodule and insert it with\nmodprobe\nsev-guest\n. This will create a new character device on the guest that can be used to generate attestation reports from the TEE:\n/dev/sev-guest\n.\nFinally, you can use AMD’s\nsnpguest\nto generate an attestation report that can be used for a remote attestation:\nsudo\n./snpguest\nreport\n--random\nattestation-report.bin\nrequest-file.txt", "meta": {"site": "documentation.ubuntu.com", "crawl_ts": "2025-11-27T10:38:34Z", "original_len_words": 508}}
{"id": "ebd318ba92", "source_url": "https://documentation.ubuntu.com/server/how-to/virtualisation/ubuntu-on-hyper-v/", "title": "How to set up Ubuntu on Hyper-V - Ubuntu Server documentation", "text": "How to set up Ubuntu on Hyper-V - Ubuntu Server documentation\nContents\nMenu\nExpand\nLight mode\nDark mode\nAuto light/dark, in light mode\nAuto light/dark, in dark mode\nSkip to content\nBack to top\nView this page\nHow to set up Ubuntu on Hyper-V\n¶\nHyper-V is a native\ntype 1 hypervisor\ndeveloped by Microsoft for the Windows family of operating systems, similar to Xen or VMWare\nESXi\n. It was first released for Windows Server in 2008, and has been available without additional charge since Windows Server 2012 and Windows 8.\nHyper-V allows Ubuntu to be run in parallel or in isolation on Windows operating systems. There are several use-cases for running Ubuntu on Hyper-V:\nTo introduce Ubuntu in a Windows-centric IT environment.\nTo have access to a complete Ubuntu desktop environment without dual-booting a PC.\nTo use Linux software on Ubuntu that is not yet supported on the\nWindows Subsystem for Linux\n.\nHyper-V system requirements\n¶\nThe following are typical\nsystem requirements for Hyper-V\n:\nA 64-bit processor with Second Level Address Translation (SLAT)\nCPU support for virtualization extensions and virtualization enabled in the system BIOS/EFI\nMinimum of 4 GB of memory, recommended 8 GB\nMinimum of 5 GB of disk space, recommended 15 GB\nInstall Hyper-V\n¶\nOur first step in enabling Ubuntu is to install Hyper-V, which can be used on the Windows 11 Pro, Enterprise, Education, and Server operating systems.\nHyper-V is not included in Windows 11 Home, which\nwould need to be upgraded\nto Windows 11 Pro.\nInstall Hyper-V graphically\n¶\nRight click on the Windows Start button and select ‘Apps and Features’.\nSelect ‘Programs and Features’ under Related Settings.\nSelect ‘Turn Windows Features on or off’.\nSelect ‘Hyper-V’ and click OK.\nRestart when prompted.\nInstall Hyper-V using PowerShell\n¶\nOpen a PowerShell console as Administrator.\nRun the following command:\nEnable\n-\nWindowsOptionalFeature\n-\nOnline\n-\nFeatureName\nMicrosoft\n-\nHyper\n-\nV\n-\nAll\nRestart when prompted.\nInstall Ubuntu on Hyper-V\n¶\nThere are two main methods for installing Ubuntu on Hyper-V depending on your use case. Read each of the descriptions of the following methods and then determine the best for your situation.\nUsing Quick Create\n¶\nThe recommended method is to use the curated Ubuntu image from the Hyper-V Quick Create Gallery. This is ideal for desktop development on Ubuntu and for users interested in running a complete Ubuntu desktop environment. The Ubuntu image from the Quick Create Gallery includes pre-configured features, such as clipboard sharing, dynamic resolution display, and shared folders.\nEnable Hyper-V as described above.\nOpen ‘Hyper-V Manager’ by either:\nSelecting the Windows Start button, then\n-> Expanding the ‘Windows Administrative Tools’ folder\n-> Selecting ‘Hyper-V Manager’\nor\nSelecting the Windows key, then\n-> typing ‘Hyper-V’\n-> selecting ‘Hyper-V Manager’\nIn the future, the Quick Create tool can be accessed directly using the above methods, but it is useful to know where Hyper-V Manager is because it is what you will use to manage your Ubuntu VM.\nOn the ‘Actions’ pane select ‘Quick Create’ and the Quick Create tool will open.\nSelect a version of Ubuntu from the versions on the list. A build of the\nmost recent LTS\nversion of Ubuntu and the\nmost recent interim release\nare provided.\nThe\nLTS version\nis recommended if you are developing for Ubuntu Server or an enterprise environment.\nThe\ninterim release\nis recommended if you would like to use the latest versions of software in Ubuntu.\nSelect ‘Create Virtual Machine’ and wait for the VM image to be downloaded.\nSelect ‘Connect’ to open a connection to your VM.\nSelect ‘Start’ to run your VM.\nComplete the final stages of the Ubuntu install, including username selection.\nUsing an Ubuntu CD image\n¶\nIt is possible to install Ubuntu on Hyper-V using a CD image ISO. This is useful if you are running Ubuntu Server and do not need an enhanced desktop experience. Note that the enhanced features of the Quick Create images are not enabled by default when you perform a manual install from an ISO.\nDownload an Ubuntu ISO from an\nofficial Ubuntu source\n.\nInstall Hyper-V as described above.\nOpen ‘Hyper-V Manager’ by either:\nSelecting the Windows Start button, then\n-> Expanding the ‘Windows Administrative Tools’ folder\n-> Selecting ‘Hyper-V Manager’\nor\nSelecting the Windows key, then\n-> Typing ‘Hyper-V’\n-> Selecting ‘Hyper-V Manager’\nOn the ‘Actions’ pane click ‘Quick Create’ and the Quick Create tool will open.\nSelect ‘Change installation source’ and choose the ISO file you downloaded before.\nIf you want to give your virtual machine a more descriptive name, select the ‘More options’ down-arrow and change ‘New Virtual Machine’ to something more useful, e.g. ‘Ubuntu Server 18.04 LTS’.\nSelect ‘Create Virtual Machine’ and wait for the virtual machine to be created.\nSelect ‘Connect’ to open a connection to your VM.\nSelect ‘File’ in the menu bar, then\n-> Choose ‘Settings’ and select the ‘Security’ tab\n-> Under Secure Boot choose ‘Microsoft UEFI Certificate Authority’\n-> Then select ‘Apply’ and ‘OK’ to return to your VM.\nSelect ‘Start’ to run your VM.\nComplete the manual installation of Ubuntu.", "meta": {"site": "documentation.ubuntu.com", "crawl_ts": "2025-11-27T10:38:34Z", "original_len_words": 850}}
{"id": "c5dc3f5011", "source_url": "https://documentation.ubuntu.com/server/how-to/virtualisation/virtual-machine-manager/", "title": "Virtual Machine Manager - Ubuntu Server documentation", "text": "Virtual Machine Manager - Ubuntu Server documentation\nContents\nMenu\nExpand\nLight mode\nDark mode\nAuto light/dark, in light mode\nAuto light/dark, in dark mode\nSkip to content\nBack to top\nView this page\nVirtual Machine Manager\n¶\nThe\nVirtual Machine Manager\n, through the\nvirt-manager\npackage, provides a graphical user interface (GUI) for managing local and remote virtual machines. In addition to the\nvirt-manager\nutility itself, the package also contains a collection of other helpful tools like\nvirt-install\n,\nvirt-clone\nand\nvirt-viewer\n.\nInstall virt-manager\n¶\nTo install\nvirt-manager\n, enter:\nsudo\napt\ninstall\nvirt-manager\nSince\nvirt-manager\nrequires a\nGraphical User Interface (GUI)\nenvironment we recommend installing it on a workstation or test machine instead of a production server. To connect to the local libvirt service, enter:\nvirt-manager\nYou can connect to the libvirt service running on another host by entering the following in a terminal prompt:\nvirt-manager\n-c\nqemu+ssh://virtnode1.mydomain.com/system\nNote\nThe above example assumes that SSH connectivity between the management system and the target system has already been configured, and uses\nSSH keys\nfor authentication. SSH keys are needed because libvirt sends the password prompt to another process. See our guide on OpenSSH for details on\nhow to set up SSH keys\n.\nUse virt-manager to manage guests\n¶\nGuest lifecycle\n¶\nWhen using\nvirt-manager\n, it is always important to know the context you’re looking at. The main window initially lists only the currently-defined guests. You’ll see their\nname\n,\nstate\n(e.g., ‘Shutoff’ or ‘Running’) and a small chart showing the\nCPU usage\n.\nIn this context, there isn’t much to do except start/stop a guest. However, by double-clicking on a guest or by clicking the\nOpen\nbutton at the top of the window, you can see the guest itself. For a running guest, that includes the guest’s main-console/virtual-screen output.\nIf you are deeper in the guest configuration, clicking on “Show the graphical console” in the top left of the guest’s window will get you back to this output.\nGuest modification\n¶\nvirt-manager\nprovides a handy, GUI-assisted way to edit guest definitions. To do so, the per-guest context view will have “Show virtual hardware details” at the top of the guest window. Here, you can edit the virtual hardware of the guest, which will alter the\nguest representation\nbehind the scenes.\nThe UI edit ability is limited to the features known to (and supported by) that GUI feature. Not only does libvirt grow features faster than\nvirt-manager\ncan keep up – adding every feature would also overload the UI and render it unusable.\nTo strike a balance between the two, there also is the XML view which can be reached via the “Edit libvirt XML” button.\nBy default, this will be read-only and you can see what the UI-driven actions have changed. You can allow read-write access in this view via the “Preferences”. This is the same content that the\nvirsh\nedit\nof the\nlibvirt-client\nexposes.\nVirtual Machine Viewer (virt-viewer)\n¶\nThe Virtual Machine Viewer application, through\nvirt-viewer\n, allows you to connect to a virtual machine’s console like\nvirt-manager\ndoes, but reduced to the GUI functionality.\nvirt-viewer\nrequires a GUI to interface with the virtual machine.\nInstall virt-viewer\n¶\nIf\nvirt-viewer\nis not already installed, you can install it from the terminal with the following command:\nsudo\napt\ninstall\nvirt-viewer\nOnce a virtual machine is installed and running you can connect to the virtual machine’s console by using:\nvirt-viewer\n<guestname>\nThe UI will show a window representing the virtual screen of the guest, just like with\nvirt-manager\nabove, but without the extra buttons and features around it.\nSimilarly to\nvirt-manager\n,\nvirt-viewer\ncan also connect to a remote host using SSH with key authentication:\nvirt-viewer\n-c\nqemu+ssh://virtnode1.mydomain.com/system\n<guestname>\nBe sure to replace\nweb_devel\nwith the appropriate virtual machine name.\nIf configured to use a\nbridged\nnetwork interface, you can also set up SSH access to the virtual machine.\nvirt-install\n¶\nvirt-install\nis part of the\nvirtinst\npackage. It can help with installing classic ISO-based systems and provides a CLI for the most common options needed to do so.\nInstall virt-install\n¶\nTo install\nvirt-install\n, if it is not installed already, run the following from a terminal prompt:\nsudo\napt\ninstall\nvirtinst\nThere are several options available when using\nvirt-install\n. For example:\nvirt-install\n\\\n--name\nweb_devel\n\\\n--ram\n8192\n\\\n--disk\npath\n=\n/home/doug/vm/web_devel.img,bus\n=\nvirtio,size\n=\n50\n\\\n--cdrom\nfocal-desktop-amd64.iso\n\\\n--network\nnetwork\n=\ndefault,model\n=\nvirtio\n\\\n--graphics\nvnc,listen\n=\n0\n.0.0.0\n\\\n--noautoconsole\n\\\n--hvm\n\\\n--vcpus\n=\n4\nThere are many more arguments that can be found in the\nvirt-install(1)\nmanpage. However, here is an explanation of arguments used in the example above, one by one:\n--name\nweb_devel\n:\nThe name of the new virtual machine will be\nweb_devel\n.\n--ram\n8192\n:\nSpecifies the amount of memory the virtual machine will use (in megabytes).\n--disk\npath=/home/doug/vm/web_devel.img,bus=virtio,size=50\n:\nIndicates the path to the virtual disk which can be a file, partition, or logical volume. In this example a file named\nweb_devel.img\nin the current user’s directory, with a size of 50 gigabytes, and using\nvirtio\nfor the disk bus. Depending on the disk path,\nvirt-install\nmay need to run with elevated privileges.\n--cdrom\nfocal-desktop-amd64.iso\n:\nFile to be used as a virtual CD-ROM. The file can be either an ISO file or the path to the host’s CD-ROM device.\n--network\n:\nProvides details related to the VM’s network interface. Here the default network is used, and the interface model is configured for\nvirtio\n.\n--graphics\nvnc,listen=0.0.0.0\n:\nExports the guest’s virtual console using VNC and on all host interfaces. Typically servers have no GUI, so another GUI-based computer on the Local Area Network (LAN) can connect via VNC to complete the installation.\n--noautoconsole\nWill not automatically connect to the virtual machine’s console.\n--hvm\n: creates a fully virtualized guest.\n--vcpus=4\n: allocate 4 virtual CPUs.\nAfter launching\nvirt-install\n, you can connect to the virtual machine’s console either locally using a GUI (if your server has a GUI), or via a remote VNC client from a GUI-based computer.\nvirt-clone\n¶\nThe\nvirt-clone\napplication can be used to copy one virtual machine to another. For example:\nvirt-clone\n--auto-clone\n--original\nfocal\nOptions used:\n--auto-clone\n:\nTo have\nvirt-clone\ncreate guest names and disk paths on its own.\n--original\n:\nName of the virtual machine to copy.\nYou can also use the\n-d\nor\n--debug\noption to help troubleshoot problems with\nvirt-clone\n.\nReplace\nfocal\nwith the appropriate virtual machine names for your case.\nCaution\nPlease be aware that this is a full clone, therefore any secrets, keys, and for example,\n/etc/machine-id\n, will be shared. This will cause issues with security and anything that needs to identify the machine like\nDHCP\n. You most likely want to edit those afterward and de-duplicate them as needed.\nResources\n¶\nSee the\nKVM\nhome page for more details.\nFor more information on libvirt see the\nlibvirt home page\nThe\nVirtual Machine Manager\nsite has more information on\nvirt-manager\ndevelopment.", "meta": {"site": "documentation.ubuntu.com", "crawl_ts": "2025-11-27T10:38:34Z", "original_len_words": 1172}}
{"id": "c65978c72c", "source_url": "https://documentation.ubuntu.com/server/how-to/web-services/", "title": "Web services - Ubuntu Server documentation", "text": "Web services - Ubuntu Server documentation\nContents\nMenu\nExpand\nLight mode\nDark mode\nAuto light/dark, in light mode\nAuto light/dark, in dark mode\nSkip to content\nBack to top\nView this page\nWeb services\n¶\nWeb servers are used to serve content over a network (or the Internet). If you want more of an introduction to the different types of web servers available in Ubuntu, check out our\nIntroduction to web servers\n.\nProxy servers\n¶\nThis section shows how to set up a Squid proxy caching server.\nInstall a Squid server\nWeb servers\n¶\nTwo of the most popular web servers in Ubuntu are Apache2 and nginx. This section covers the installation, configuration and extension of both.\nApache2\n¶\nInstall Apache2\nConfigure Apache2\nExtend Apache2 with modules\nNginx\n¶\nInstall nginx\nConfigure nginx\nExtend nginx with modules\nWeb programming\n¶\nIt is common to set up server-side scripting languages to support the creation of dynamic web content. Whichever scripting language you choose, you will need to have installed and configured your web and database servers beforehand.\nInstall PHP\nInstall Ruby on Rails\nSee also\n¶\nExplanation:\nWeb services", "meta": {"site": "documentation.ubuntu.com", "crawl_ts": "2025-11-27T10:38:35Z", "original_len_words": 189}}
{"id": "9b7f845e4b", "source_url": "https://documentation.ubuntu.com/server/how-to/web-services/configure-apache2-settings/", "title": "How to configure Apache2 settings - Ubuntu Server documentation", "text": "How to configure Apache2 settings - Ubuntu Server documentation\nContents\nMenu\nExpand\nLight mode\nDark mode\nAuto light/dark, in light mode\nAuto light/dark, in dark mode\nSkip to content\nBack to top\nView this page\nHow to configure Apache2 settings\n¶\nAfter you have\ninstalled Apache2\n, you will likely need to configure it. In this explanatory guide, we will explain the Apache2 server essential configuration parameters.\nBasic directives\n¶\nApache2 ships with a “virtual-host-friendly” default configuration – it is configured with a single default virtual host (using the\nVirtualHost\ndirective) which can be modified or used as-is if you have a single site, or used as a template for additional virtual hosts if you have multiple sites.\nIf left alone, the default virtual host will serve as your default site, or the site users will see if the URL they enter does not match the\nServerName\ndirective of any of your custom sites. To modify the default virtual host, edit the file\n/etc/apache2/sites-available/000-default.conf\n.\nNote\nThe directives set for a virtual host only apply to that particular virtual host. If a directive is set server-wide and not defined in the virtual host settings, the default setting is used. For example, you can define a Webmaster email address and not define individual email addresses for each virtual host.\nIf you want to configure a new virtual host or site, copy the\n000-default.conf\nfile into the same directory with a name you choose. For example:\nsudo\ncp\n/etc/apache2/sites-available/000-default.conf\n/etc/apache2/sites-available/mynewsite.conf\nEdit the new file to configure the new site using some of the directives described below:\nThe\nServerAdmin\ndirective\n¶\nFound in\n/etc/apache2/sites-available\nSpecifies the email address to be advertised for the server’s administrator. The default value is\nwebmaster@localhost\n. This should be changed to an email address that is delivered to you (if you are the server’s administrator). If your website has a problem, Apache2 will display an error message containing this email address to report the problem to.\nThe\nListen\ndirective\n¶\nFound in\n/etc/apache2/ports.conf\nSpecifies the port, and optionally the IP address, Apache2 should listen on. If the IP address is not specified, Apache2 will listen on all IP addresses assigned to the machine it runs on. The default value for the\nListen\ndirective is\n80\n. Change this to:\n127.0.0.1:80\nto make Apache2 listen only on your loopback interface so that it will not be available to the Internet,\nto e.g.\n81\nto change the port that it listens on,\nor leave it as is for normal operation.\nThe\nServerName\ndirective (optional)\n¶\nSpecifies what\nFQDN\nyour site should answer to. The default virtual host has no\nServerName\ndirective specified, so it will respond to all requests that do not match a ServerName directive in another virtual host. If you have just acquired the domain name\nmynewsite.com\nand wish to host it on your Ubuntu server, the value of the ServerName directive in your virtual host configuration file should be\nmynewsite.com\n.\nAdd this directive to the new virtual host file you created earlier (\n/etc/apache2/sites-available/mynewsite.conf\n).\nThe\nServerAlias\ndirective\n¶\nYou may also want your site to respond to\nwww.mynewsite.com\n, since many users will assume the www prefix is appropriate – use the\nServerAlias\ndirective for this. You may also use wildcards in the ServerAlias directive.\nFor example, the following configuration will cause your site to respond to any domain request ending in\n.mynewsite.com\n.\nServerAlias *.mynewsite.com\nThe\nDocumentRoot\ndirective\n¶\nSpecifies where Apache2 should look for the files that make up the site. The default value is\n/var/www/html\n, as specified in\n/etc/apache2/sites-available/000-default.conf\n. If desired, change this value in your site’s virtual host file, and remember to create that directory if necessary!\nEnable the new\nVirtualHost\nusing the a2ensite utility and restart Apache2:\nsudo\na2ensite\nmynewsite\nsudo\nsystemctl\nrestart\napache2.service\nNote\nBe sure to replace\nmynewsite\nwith a more descriptive name for the VirtualHost. One method is to name the file after the\nServerName\ndirective of the VirtualHost.\nSimilarly, use the\na2dissite\nutility to disable sites. This is can be useful when troubleshooting configuration problems with multiple virtual hosts:\nsudo\na2dissite\nmynewsite\nsudo\nsystemctl\nrestart\napache2.service\nApache2 server default settings\n¶\nThis section explains configuration of the Apache2 server default settings. For example, if you add a virtual host, the settings you configure for the virtual host take precedence for that virtual host. For a directive not defined within the virtual host settings, the default value is used.\nThe\nDirectoryIndex\n¶\nThe\nDirectoryIndex\nis the default page served by the server when a user requests an index of a directory by specifying a forward slash (/) at the end of the directory name.\nFor example, when a user requests the page\nhttp://www.example.com/this_directory/\n, they will get either the DirectoryIndex page (if it exists), a server-generated directory list (if it does not and the Indexes option is specified), or a Permission Denied page if neither is true.\nThe server will try to find one of the files listed in the DirectoryIndex directive and will return the first one it finds. If it does not find any of these files and if\nOptions Indexes\nis set for that directory, the server will generate and return a list, in HTML format, of the subdirectories and files in the directory. The default value, found in\n/etc/apache2/mods-available/dir.conf\nis “index.html index.cgi\nindex.pl\nindex.php index.xhtml index.htm”. Thus, if Apache2 finds a file in a requested directory matching any of these names, the first will be displayed.\nThe\nErrorDocument\n¶\nThe\nErrorDocument\ndirective allows you to specify a file for Apache2 to use for specific error events. For example, if a user requests a resource that does not exist, a 404 error will occur.\nBy default, Apache2 will return a HTTP 404 Return code. Read\n/etc/apache2/conf-available/localized-error-pages.conf\nfor detailed instructions on using ErrorDocument, including locations of example files.\nCustomLog\nand\nErrorLog\n¶\nBy default, the server writes the transfer log to the file\n/var/log/apache2/access.log\n. You can change this on a per-site basis in your virtual host configuration files with the\nCustomLog\ndirective, or omit it to accept the default, specified in\n/etc/apache2/conf-available/other-vhosts-access-log.conf\n.\nYou can also specify the file to which errors are logged, via the\nErrorLog\ndirective, whose default is\n/var/log/apache2/error.log\n. These are kept separate from the transfer logs to aid in troubleshooting problems with your Apache2 server. You may also specify the\nLogLevel\n(the default value is “warn”) and the\nLogFormat\n(see\n/etc/apache2/apache2.conf\nfor the default value).\nThe\nOptions\ndirective\n¶\nSome options are specified on a per-directory basis rather than per-server.\nOptions\nis one of these directives. A Directory stanza is enclosed in XML-like tags, like so:\n<Directory /var/www/html/mynewsite>\n...\n</Directory>\nThe Options directive within a Directory stanza accepts one or more of the following values (among others), separated by spaces:\nExecCGI\nAllow CGI scripts to be run. CGI scripts are not run if this option is not chosen.\nCaution\nMost files should not be run as CGI scripts. This would be very dangerous. CGI scripts should kept in a directory separate from and outside your\nDocumentRoot\n, and only this directory should have the ExecCGI option set. This is the default, and the default location for CGI scripts is\n/usr/lib/cgi-bin\n.\nIncludes\nAllow\nserver-side includes\n. Server-side includes allow an HTML file to\ninclude\nother files. See\nApache SSI documentation (Ubuntu community)\nfor more information.\nIncludesNOEXEC\nAllow server-side includes, but disable the\n#exec\nand\n#include\ncommands in CGI scripts.\nIndexes\nDisplay a formatted list of the directory’s contents, if no DirectoryIndex (such as\nindex.html\n) exists in the requested directory.\nCaution\nFor security reasons, this should usually not be set, and certainly should not be set on your DocumentRoot directory. Enable this option carefully on a per-directory basis\nonly\nif you are certain you want users to see the entire contents of the directory.\nMultiview\nSupport content-negotiated multiviews; this option is disabled by default for security reasons. See the\nApache2 documentation on this option\n.\nSymLinksIfOwnerMatch\nOnly follow symbolic links if the target file or directory has the same owner as the link.\nApache2 daemon settings\n¶\nThis section briefly explains some basic Apache2 daemon configuration settings.\nLockFile\nThe\nLockFile\ndirective sets the path to the lockfile used when the server is compiled with either\nUSE_FCNTL_SERIALIZED_ACCEPT\nor\nUSE_FLOCK_SERIALIZED_ACCEPT\n. It must be stored on the local disk. It should be left to the default value unless the logs directory is located on an NFS share. If this is the case, the default value should be changed to a location on the local disk and to a directory that is readable only by root.\nPidFile\nThe\nPidFile\ndirective sets the file in which the server records its process ID (pid). This file should only be readable by root. In most cases, it should be left to the default value.\nUser\nThe\nUser\ndirective sets the userid used by the server to answer requests. This setting determines the server’s access. Any files inaccessible to this user will also be inaccessible to your website’s visitors. The default value for User is “www-data”.\nWarning\nUnless you know exactly what you are doing, do not set the User directive to root. Using root as the User will create large security holes for your Web server.\nGroup\nThe\nGroup\ndirective is similar to the User directive. Group sets the group under which the server will answer requests. The default group is also “www-data”.\nExtending Apache2\n¶\nNow that you know how to configure Apache2, you may also want to know\nhow to extend Apache2\nwith modules.\nFurther reading\n¶\nThe\nApache2 Documentation\ncontains in depth information on Apache2 configuration directives. Also, see the\napache2-doc\npackage for the official Apache2 docs.\nO’Reilly’s\nApache Cookbook\nis a good resource for accomplishing specific Apache2 configurations.\nFor Ubuntu specific Apache2 questions, ask in the\n#ubuntu-server\nIRC channel on\nlibera.chat\n.", "meta": {"site": "documentation.ubuntu.com", "crawl_ts": "2025-11-27T10:38:35Z", "original_len_words": 1643}}
{"id": "63be990c25", "source_url": "https://documentation.ubuntu.com/server/how-to/web-services/configure-nginx/", "title": "How to configure nginx - Ubuntu Server documentation", "text": "How to configure nginx - Ubuntu Server documentation\nContents\nMenu\nExpand\nLight mode\nDark mode\nAuto light/dark, in light mode\nAuto light/dark, in dark mode\nSkip to content\nBack to top\nView this page\nHow to configure nginx\n¶\nOnce you have\ninstalled nginx\n, you can customize it for your use with the configuration options explained in this guide.\nServer blocks\n¶\nnginx organizes sets of site-specific configuration details into\nserver blocks\n, and by default comes pre-configured for single-site operation. This can either be used “as-is”, or as a starting template\nfor serving multiple sites.\nThe single-site configuration serves files out of\n/var/www/html\n, as defined by the server block and as provided by\n/etc/nginx/sites-enabled/default\n:\nserver {\n        listen 80 default_server;                                                                                    \n        listen [::]:80 default_server;\n\n        root /var/www/html;                                                                                          \n                                                                                                                         \n        # Add index.php to the list if you are using PHP                                                             \n        index index.html index.htm index.nginx-debian.html;                                                          \n                                                                                                                         \n        server_name _;                                                                                               \n                                                                                                                         \n        location / {                                                                                                 \n                # First attempt to serve request as file, then                                                       \n                # as directory, then fall back to displaying a 404.                                                  \n                try_files $uri $uri/ =404;                                                                           \n        }\n}\nEven for a single-site configuration, while you can place your website at\n/var/www/html\n, you may want to place the website’s files at a different location in your\nfilesystem\n. For example, if you were hosting\nwww.my-site.org\nfrom\n/srv/my-site/html\nyou might edit the above file to look like this:\nserver {\n        listen                80;\n        root                  /srv/my-site/html;\n        index                 index.html;\n        server_name           my-site.org www.my-site.org;\n\n        location / {                                                                                                 \n                try_files $uri $uri/ =404;                                                                           \n        }\n}\nMake sure to create your web root directory structure:\n$\nsudo\nmkdir\n-p\n/srv/my-site/html\n$\nsudo\nchmod\n-R\n755\n/srv/my-site/html\n$\necho\n\"<html><body><h1>My Site!</h1></body></html>\"\n>\n/srv/my-site/html/index.html\nThen, to make nginx reload its configuration, run:\n$\nsudo\nsystemctl\nreload\nnginx\nCheck that the settings have taken effect using your web browser:\n$\nwww-browser\nwww.my-site.org\nMulti-site hosting\n¶\nSimilar to Apache, nginx uses the\nsites-available\nand\nsites-enabled\ndirectories for the configurations of multiple websites.  Unlike with Apache, you’ll need to handle the enablement manually.\nTo do that, first create a new server block in a configuration file as above, and save it to\n/etc/nginx/sites-available/<your-domain>\n. Make sure to give each site a unique\nserver_name\nand a different\nlisten\nport number.\nNext, enable the site by creating a symlink to it from the\nsites-enabled\ndirectory:\n$\nsudo\nln\n-s\n/etc/nginx/sites-available/<your-domain>\n/etc/nginx/sites-enabled/\nTo disable a website, you can delete the symlink in\nsites-enabled\n. For example, once you have your new site(s) configured and no longer need the default site configuration:\n$\nsudo\nrm\n/etc/nginx/sites-enabled/default\nSSL and HTTPS\n¶\nWhile establishing an HTTP website on port 80 is a good starting point (and perhaps adequate for static content), production systems will want HTTPS, such as serving on port 443 with SSL enabled via\ncert\nfiles.  A server block with such a configuration might look like this, with HTTP-to-HTTPS redirection handled in the first block, and HTTPS in the second block:\nserver {\n        listen                80;\n        server_name           our-site.org www.our-site.org;\n        return                301 https://$host$request_uri;\n}\n\nserver {\n        listen                443 ssl;\n\n        root                  /srv/our-site/html;\n        index                 index.html;\n\n        server_name           our-site.org www.our-site.org;\n                                                   \n        ssl_certificate       our-site.org.crt;\n        ssl_certificate_key   our-site.org.key;\n        ssl_protocols         TLSv1 TLSv1.1 TLSv1.2 TLSv1.3;\n        ssl_ciphers           HIGH:!aNULL:!MD5;\n        ssl_session_timeout   15m;\n\n        location / {\n                try_files $uri $uri/ =404;\n        }\n}\nThanks to the\nreturn\n301\nline in the above configuration, anyone visiting the site on port 80 via an HTTP URL will get automatically redirected to the equivalent secure HTTPS URL.\nRefer to the\nsecurity - certificates\npage in this manual for details on how to create and manage certificates, and the\nOpenSSL\npage for additional details on configuring and using that service. The\nGnuTLS\nsection explains how to configure different SSL protocol versions and their associated ciphers.\nFor example, to generate a self-signed certificate, you might run a set of commands similar to these:\n$\nsudo\nopenssl\ngenrsa\n-out\nour-site.org.key\n2048\n$\nopenssl\nreq\n-nodes\n-new\n-key\nour-site.org.key\n-out\nca.csr\n$\nopenssl\nx509\n-req\n-days\n365\n-in\nour-site.org.csr\n-signkey\nour-site.org.key\n-out\nour-site.org.crt\n$\nmkdir\n/etc/apache2/ssl\n$\ncp\nour-site.org.crt\nour-site.org.key\nour-site.org.csr\n/etc/apache2/ssl/\nSetting up nginx\n¶\nBeyond the settings outlined above, nginx can be further customized through the use of modules.  Please see the next guide in this series for details of how to do that.\nPart 3:\nHow to use nginx modules\nFurther reading\n¶\nnginx’s beginner’s guide\ncovers use cases such as proxy servers,\nFastCGI\nfor use with PHP and other frameworks, and optimising the handling of static content.\nThe\nnginx documentation\ndescribes HTTPS server configuration in greater detail, including certificate chains, disambiguating various multi-site certificate situations, performance optimisations and compatibility issues.\nFor Ubuntu-specific nginx questions, ask in the\n#ubuntu-server\nIRC channel on\nlibera.chat\n.", "meta": {"site": "documentation.ubuntu.com", "crawl_ts": "2025-11-27T10:38:35Z", "original_len_words": 760}}
{"id": "f07cba557b", "source_url": "https://documentation.ubuntu.com/server/how-to/web-services/install-a-squid-server/", "title": "How to install a Squid server - Ubuntu Server documentation", "text": "How to install a Squid server - Ubuntu Server documentation\nContents\nMenu\nExpand\nLight mode\nDark mode\nAuto light/dark, in light mode\nAuto light/dark, in dark mode\nSkip to content\nBack to top\nView this page\nHow to install a Squid server\n¶\nSquid is a filtering and caching mechanism for web servers that can optimise bandwidth and performance. For more information about Squid proxy servers,\nrefer to this guide\n.\nInstall Squid\n¶\nAt a terminal prompt, enter the following command to install the Squid server:\nsudo\napt\ninstall\nsquid\nConfigure Squid\n¶\nSquid is configured by editing directives in the\n/etc/squid/squid.conf\nconfiguration file. The following examples illustrate a sample of directives that can be modified to configure the Squid server’s behavior. For more in-depth configuration details, see the links at the bottom of the page.\nProtect the original config file\n¶\nBefore editing the configuration file, you should make a copy of the original and protect it from writing. You will then have the original settings as a reference, and can reuse it when needed. Run the following commands to make a copy of the original configuration file and protect it from being written to:\nsudo\ncp\n/etc/squid/squid.conf\n/etc/squid/squid.conf.original\nsudo\nchmod\na-w\n/etc/squid/squid.conf.original\nChange TCP port\n¶\nTo set your Squid server to listen on TCP port 8888 instead of the default TCP port 3128, change the\nhttp_port\ndirective as such:\nhttp_port 8888\nSet the hostname\n¶\nChange the\nvisible_hostname\ndirective to give the Squid server a specific\nhostname\n. This hostname does not need to be the same as the computer’s hostname. In this example it is set to\nweezie\n:\nvisible_hostname weezie\nConfigure the memory cache\n¶\nThe default setting is to use on-memory cache. This example tells squid to use up to 512MB of memory, erasing the last recently used content when the cache is full to free space for new items:\ncache_mem 512 MB\nmaximum_memory_policy lru\nConfigure on-disk cache\n¶\nBy changing the\ncache_dir\ndirective you can configure use of an on-disk cache. The\ncache_dir\ndirective takes the following arguments:\ncache_dir <Type> <Directory-Name> <Size-in-MB> <L1-Dirs> <L2-Dirs> [options]\nIn this example we set the cache configuration to use a\nufs\nstorage in\n/var/spool/squid\n, up to 10GB, with 16 directories on the first level of the hierarchy, each of those containing 256 directories for organization.\ncache_dir ufs /var/spool/squid 10000 16 256\nThe available storage types are:\nufs\n: This is the common Squid storage format, good for general use.\naufs\n: Uses the same storage format as\nufs\n, using POSIX-threads to avoid blocking the main Squid process on disk-I/O. This was formerly known in Squid as\nasync-io\n.\ndiskd\n: Uses the same storage format as\nufs\n, using a separate process to avoid blocking the main Squid process on disk-I/O.\nrock\n: This is a database-style storage. All cached entries are stored in a “database” file, using fixed-size slots. A single entry occupies one or more slots.\nConfigure cached objects size limits\n¶\nThe following configuration directives control which objects get cached based on their size, for space optimization, both on disk and in memory:\nmaximum_object_size 512 MB\nminimum_object_size 0 KB\nmaximum_object_size_in_memory 512 KB\nConfigure cached objects lifetime\n¶\nUsing the\nrefresh_pattern\nconfiguration directive controls how long cached objects stay fresh before they need to be revalidated with the origin server. It is configured as:\nrefresh_pattern regex min percent max [options]\nwhere\nregex\nneeds to match against the filename,\nmin\nand\nmax\nset the time limits in minutes for freshness, and a\npercent\nof the object’s age to calculate the refresh threshold.\nIn the following example, static web assets (such as images, css and scripts) are configured to be kept for 7 to 30 days + 90% of their age, based on the\nLast-Modified\nheader, while everything else is kept up to 3 days + 20% of their age.\nrefresh_pattern -i \\.(gif|jpg|png|css|js)$  10080  90%  43200\nrefresh_pattern .                           0      20%  4320\nCaching HTTPS content\n¶\nBy default, Squid can’t cache HTTPS because the traffic is encrypted. There are different strategies for enabling HTTPS caching, such as TLS interception via\nCONNECT\nrequests, origin server caching based on\nCache-Control\nand\nETag\nheaders, or access-control only solutions.\nPlease refer to the\nSquid HTTPS documentation\nto learn more.\nOther caching configuration options\n¶\nDifferent options can be used to fine-tune the caching behavior overall, by determining how squid stores files in the hierarchy, the algorithm for the replacement policy, DNS cache settings, compatibility with different scenarios, and more.\nFor a full list of configuration entries, please refer to the\nSquid configuration guide\n.\nAccess control\n¶\nUsing Squid’s access control, you can configure use of Squid-proxied Internet services to be available only to users with certain Internet Protocol (IP) addresses. For example, we will illustrate access by users of the\n192.168.42.0/24\nsubnetwork only:\nAdd the following to the\nbottom\nof the\nACL\nsection of your\n/etc/squid/squid.conf\nfile:\nacl fortytwo_network src 192.168.42.0/24\nThen, add the following to the\ntop\nof the\nhttp_access\nsection of your\n/etc/squid/squid.conf\nfile:\nhttp_access allow fortytwo_network\nUsing Squid’s access control features, you can configure Squid-proxied Internet services to only be available during normal business hours. As an example, we’ll illustrate access by employees of a business which is operating between 9:00AM and 5:00PM, Monday through Friday, and which uses the\n10.1.42.0/24\nsubnetwork:\nAdd the following to the\nbottom\nof the ACL section of your\n/etc/squid/squid.conf\nfile:\nacl biz_network src 10.1.42.0/24\nacl biz_hours time M T W T F 9:00-17:00\nThen, add the following to the\ntop\nof the\nhttp_access\nsection of your\n/etc/squid/squid.conf\nfile:\nhttp_access allow biz_network biz_hours\nRestart the Squid server\n¶\nAfter making any changes to the\n/etc/squid/squid.conf\nfile, you will need to save the file and restart the squid server application.\nFirst, you can verify the syntax of your configuration file by running:\nsudo\nsquid\n-k\nparse\nYou can restart the server using the following command:\nsudo\nsystemctl\nrestart\nsquid.service\nNote\nIf a formerly customized squid3 was used to set up the spool at\n/var/log/squid3\nto be a mount point, but otherwise kept the default configuration, the upgrade will fail. The upgrade tries to rename/move files as needed, but it can’t do so for an active mount point. In that case you will need to adapt either the mount point or the config in\n/etc/squid/squid.conf\nso that they match.\nThe same applies if the\ninclude\nconfig statement was used to pull in more files from the old path at\n/etc/squid3/\n. In those cases you should move and adapt your configuration accordingly.\nTroubleshooting\n¶\nTo monitor Squid behavior and check for potential errors and problems, there are useful commands to be executed and files to be checked.\nSquid version and status can be checked with:\nsudo\nsquid\n-v\nsudo\nsystemctl\nstatus\nsquid\nChecking or watching the log files may be useful to see potential errors, and to verify cache hits and misses:\nsudo\ncat\n/var/log/squid/cache.log\nsudo\ncat\n/var/log/squid/access.log\nFor a status summary containing runtime statistics and congfiguration, run:\nsquidclient\nmgr:info\nWhile monitoring, these cache status indicators can help identifying what is happening with requests:\nTCP_MISS\n: Content not in cache, fetched from origin\nTCP_HIT\n: Content served from disk cache\nTCP_MEM_HIT\n: Content served from memory cache\nTCP_REFRESH_HIT\n: Cached content revalidated with origin\nTCP_TUNNEL\n: HTTPS traffic (not cached by default)\nA healthy cache should show increasing hit ratios over time, of non-zero size, and a growing number of cached objects.\nFurther reading\n¶\nThe Squid Website\nUbuntu Wiki page on Squid\n.", "meta": {"site": "documentation.ubuntu.com", "crawl_ts": "2025-11-27T10:38:35Z", "original_len_words": 1252}}
{"id": "ada103a01f", "source_url": "https://documentation.ubuntu.com/server/how-to/web-services/install-apache2/", "title": "How to install Apache2 - Ubuntu Server documentation", "text": "How to install Apache2 - Ubuntu Server documentation\nContents\nMenu\nExpand\nLight mode\nDark mode\nAuto light/dark, in light mode\nAuto light/dark, in dark mode\nSkip to content\nBack to top\nView this page\nHow to install Apache2\n¶\nThe Apache HTTP Server\n(“httpd”) is the most commonly used web server on Linux systems, and is often used as part of the LAMP configuration. In this guide, we will show you how to install and configure Apache2, which is the current release of “httpd”.\nInstall\napache2\n¶\nTo install Apache2, enter the following command at the terminal prompt:\nsudo\napt\ninstall\napache2\nConfigure\napache2\n¶\nApache2 is configured by placing\ndirectives\nin plain text configuration files in\n/etc/apache2/\n. These\ndirectives\nare separated between the following files and directories:\nFiles\n¶\napache2.conf\nThe main Apache2 configuration file. Contains settings that are\nglobal\nto Apache2.\nNote\nHistorically, the main Apache2 configuration file was\nhttpd.conf\n, named after the “httpd” daemon. In other distributions (or older versions of Ubuntu), the file might be present. In modern releases of Ubuntu, all configuration options have been moved to\napache2.conf\nand the below referenced directories and\nhttpd.conf\nno longer exists.\nenvvars\nFile where Apache2\nenvironment\nvariables are set.\nmagic\nInstructions for determining MIME type based on the first few bytes of a file.\nports.conf\nHouses the directives that determine which TCP ports Apache2 is listening on.\nIn addition, other configuration files may be added using the\nInclude\ndirective, and wildcards can be used to include many configuration files. Any directive may be placed in any of these configuration files. Changes to the main configuration files are only recognized by Apache2 when it is started or restarted.\nThe server also reads a file containing MIME document types; the filename is set by the\nTypesConfig\ndirective, typically via\n/etc/apache2/mods-available/mime.conf\n, which might also include additions and overrides, and is\n/etc/mime.types\nby default.\nDirectories\n¶\nconf-available\nThis directory contains available configuration files. All files that were previously in\n/etc/apache2/conf.d\nshould be moved to\n/etc/apache2/conf-available\n.\nconf-enabled\nHolds\nsymlinks\nto the files in\n/etc/apache2/conf-available\n. When a configuration file is symlinked, it will be enabled the next time Apache2 is restarted.\nmods-available\nThis directory contains configuration files to both load\nmodules\nand configure them. Not all modules will have specific configuration files, however.\nmods-enabled\nHolds symlinks to the files in\n/etc/apache2/mods-available\n. When a module configuration file is symlinked it will be enabled the next time Apache2 is restarted.\nsites-available\nThis directory has configuration files for Apache2\nVirtual Hosts\n. Virtual Hosts allow Apache2 to be configured for multiple sites that have separate configurations.\nsites-enabled\nLike\nmods-enabled\n,\nsites-enabled\ncontains symlinks to the\n/etc/apache2/sites-available\ndirectory. Similarly, when a configuration file in\nsites-available\nis symlinked, the site configured by it will be active once Apache2 is restarted.\nDetailed configuration\n¶\nFor more detailed information on configuring Apache2, check out our follow-up guides.\nPart 2:\nApache2 configuration settings\nPart 3:\nhow to extend Apache2\nwith modules.\nFurther reading\n¶\nApache2 Documentation\ncontains in depth information on Apache2 configuration directives. Also, see the\napache2-doc\npackage for the official Apache2 docs.\nO’Reilly’s\nApache Cookbook\nis a good resource for accomplishing specific Apache2 configurations.\nFor Ubuntu-specific Apache2 questions, ask in the\n#ubuntu-server\nIRC channel on\nlibera.chat\n.", "meta": {"site": "documentation.ubuntu.com", "crawl_ts": "2025-11-27T10:38:36Z", "original_len_words": 543}}
{"id": "1a0aac9502", "source_url": "https://documentation.ubuntu.com/server/how-to/web-services/install-nginx/", "title": "How to install nginx - Ubuntu Server documentation", "text": "How to install nginx - Ubuntu Server documentation\nContents\nMenu\nExpand\nLight mode\nDark mode\nAuto light/dark, in light mode\nAuto light/dark, in dark mode\nSkip to content\nBack to top\nView this page\nHow to install nginx\n¶\nThe nginx HTTP server is a powerful alternative to\nApache\n. In this guide, we will demonstrate how to install and use nginx for web services.\nInstall nginx\n¶\nTo install nginx, enter the following command at the terminal prompt:\n$\nsudo\napt\nupdate\n$\nsudo\napt\ninstall\nnginx\nThis will also install any required dependency packages, and some common mods for your server, and then start the nginx web server.\nVerify nginx is running\n¶\nYou can verify that nginx is running via this command:\n$\nsudo\nsystemctl\nstatus\nnginx\n●\nnginx.service\n-\nA\nhigh\nperformance\nweb\nserver\nand\na\nreverse\nproxy\nserver\nLoaded:\nloaded\n(\n/lib/systemd/system/nginx.service\n;\nenabled\n;\nvendor\npreset:\nenabled\n)\nActive:\nactive\n(\nrunning\n)\nsince\nSun\n2023\n-08-20\n01\n:04:22\nUTC\n;\n53s\nago\nDocs:\nman:nginx\n(\n8\n)\nProcess:\n28210\nExecStartPre\n=\n/usr/sbin/nginx\n-t\n-q\n-g\ndaemon\non\n;\nmaster_process\non\n;\n(\ncode\n=\nexited,\nstatus\n=\n0\n/SU\n\\\nCCESS\n)\nProcess:\n28211\nExecStart\n=\n/usr/sbin/nginx\n-g\ndaemon\non\n;\nmaster_process\non\n;\n(\ncode\n=\nexited,\nstatus\n=\n0\n/SUCCESS\n)\nMain\nPID:\n28312\n(\nnginx\n)\nTasks:\n13\n(\nlimit:\n76969\n)\nMemory:\n13\n.1M\nCPU:\n105ms\nCGroup:\n/system.slice/nginx.service\n├─28312\n\"nginx: master process /usr/sbin/nginx -g daemon on; master_process on;\"\n├─28314\n\"nginx: worker process\"\n\"\"\n\"\"\n\"\"\n\"\"\n\"\"\n\"\"\n\"\"\n\"\"\n\"\"\n\"\"\n\"\"\n\"\"\n\"\"\n\"\"\n\"\"\n\"\"\n\"\"\n...\nRestarting nginx\n¶\nTo restart nginx, run:\n$\nsudo\nsystemctl\nrestart\nnginx\nEnable/disable nginx manually\n¶\nBy default, Nginx will automatically start at boot time.  To disable this behavior so that you can start it up manually, you can disable it:\n$\nsudo\nsystemctl\ndisable\nnginx\nThen, to re-enable it, run:\n$\nsudo\nsystemctl\nenable\nnginx\nThe default nginx homepage\n¶\nA default nginx home page is also set up during the installation process. You can load this page in your web browser using your web server’s IP address; http://\nyour_server_ip\n.\nThe default home page should look similar to:\nWelcome to nginx!        \n                                              Welcome to nginx!\n\nIf you see this page, the nginx web server is successfully installed and working. Further configuration is\nrequired.\n\nFor online documentation and support please refer to nginx.org.\nCommercial support is available at nginx.com.\n\nThank you for using nginx.\nSetting up nginx\n¶\nFor more information on customizing nginx for your needs, see these follow-up guides:\nPart 2: {ref}`How to configure nginx\nPart 3: {ref}`How to use nginx modules\nFurther reading\n¶\nThe\nnginx documentation\nprovides detailed explanations of configuration directives.\nO’Reilly’s nginx cookbook provides guidance on solving specific needs\nFor Ubuntu-specific nginx questions, ask in the\n#ubuntu-server\nIRC channel on\nlibera.chat\n.", "meta": {"site": "documentation.ubuntu.com", "crawl_ts": "2025-11-27T10:38:36Z", "original_len_words": 479}}
{"id": "190befa241", "source_url": "https://documentation.ubuntu.com/server/how-to/web-services/install-php/", "title": "How to install and configure PHP - Ubuntu Server documentation", "text": "How to install and configure PHP - Ubuntu Server documentation\nContents\nMenu\nExpand\nLight mode\nDark mode\nAuto light/dark, in light mode\nAuto light/dark, in dark mode\nSkip to content\nBack to top\nView this page\nHow to install and configure PHP\n¶\nPHP\nis a general-purpose scripting language well-suited for Web development since PHP scripts can be embedded into HTML. This guide explains how to install and configure PHP in an Ubuntu System with Apache2 and MySQL.\nPrerequisites\n¶\nBefore installing PHP you should install Apache (or a preferred web server) and a database service such as MySQL.\nTo install the Apache package, please refer to\nour Apache guide\n.\nTo install and configure a MySQL database service, refer to\nour MySQL guide\n.\nInstall PHP\n¶\nPHP is available on Ubuntu Linux, but unlike Python (which comes pre-installed), must be manually installed.\nTo install PHP – and the Apache PHP module – you can enter the following command into a terminal prompt:\nsudo\napt\ninstall\nphp\nlibapache2-mod-php\nInstall optional packages\n¶\nThe following packages are optional, and can be installed if you need them for your setup.\nPHP-CLI\nYou can run PHP scripts via the Command Line Interface (CLI). To do this, you must first install the\nphp-cli\npackage. You can install it by running the following command:\nsudo\napt\ninstall\nphp-cli\nPHP-CGI\nYou can also execute PHP scripts without installing the Apache PHP module. To accomplish this, you should install the\nphp-cgi\npackage via this command:\nsudo\napt\ninstall\nphp-cgi\nPHP-MySQL\nTo use MySQL with PHP you should install the\nphp-mysql\npackage, like so:\nsudo\napt\ninstall\nphp-mysql\nPHP-PgSQL\nSimilarly, to use PostgreSQL with PHP you should install the\nphp-pgsql\npackage:\nsudo\napt\ninstall\nphp-pgsql\nConfigure PHP\n¶\nIf you have installed the\nlibapache2-mod-php\nor\nphp-cgi\npackages, you can run PHP scripts from your web browser. If you have installed the\nphp-cli\npackage, you can run PHP scripts at a terminal prompt.\nBy default, when\nlibapache2-mod-php\nis installed, the Apache2 web server is configured to run PHP scripts using this module. First, verify if the files\n/etc/apache2/mods-enabled/php8.*.conf\nand\n/etc/apache2/mods-enabled/php8.*.load\nexist. If they do not exist, you can enable the module using the\na2enmod\ncommand.\nOnce you have installed the PHP-related packages and enabled the Apache PHP module, you should restart the Apache2 web server to run PHP scripts, by running the following command:\nsudo\nsystemctl\nrestart\napache2.service\nTest your setup\n¶\nTo verify your installation, you can run the following PHP\nphpinfo\nscript:\n<?php\nphpinfo\n();\n?>\nYou can save the content in a file –\nphpinfo.php\nfor example – and place it under the\nDocumentRoot\ndirectory of the Apache2 web server. Pointing your browser to\nhttp://hostname/phpinfo.php\nwill display the values of various PHP configuration parameters.\nFurther reading\n¶\nFor more in depth information see\nthe php.net documentation\n.\nThere are a plethora of books on PHP 7 and PHP 8. A good book from O’Reilly is “Learning PHP”, which includes an exploration of PHP 7’s enhancements to the language.\nAlso, see the\nApache MySQL PHP Ubuntu Wiki\npage for more information.", "meta": {"site": "documentation.ubuntu.com", "crawl_ts": "2025-11-27T10:38:36Z", "original_len_words": 515}}
{"id": "54c633387e", "source_url": "https://documentation.ubuntu.com/server/how-to/web-services/install-ruby-on-rails/", "title": "How to install and configure Ruby on Rails - Ubuntu Server documentation", "text": "How to install and configure Ruby on Rails - Ubuntu Server documentation\nContents\nMenu\nExpand\nLight mode\nDark mode\nAuto light/dark, in light mode\nAuto light/dark, in dark mode\nSkip to content\nBack to top\nView this page\nHow to install and configure Ruby on Rails\n¶\nRuby on Rails\nis an open source web framework for developing database-backed web applications. It is optimized for sustainable productivity of the programmer since it lets the programmer to write code by favoring convention over configuration. This guide explains how to install and configure Ruby on Rails for an Ubuntu system with Apache2 and MySQL.\nPrerequisites\n¶\nBefore installing Rails you should install Apache (or a preferred web server) and a database service such as MySQL.\nTo install the Apache package, please refer to\nour Apache guide\n.\nTo install and configure a MySQL database service, refer to\nour MySQL guide\n.\nInstall\nrails\n¶\nOnce you have a web server and a database service installed and configured, you are ready to install the Ruby on Rails package,\nrails\n, by entering the following in the terminal prompt.\nsudo\napt\ninstall\nrails\nThis will install both the Ruby base packages, and Ruby on Rails.\nConfigure the web server\n¶\nYou will need to modify the\n/etc/apache2/sites-available/000-default.conf\nconfiguration file to set up your domains.\nThe first thing to change is the\nDocumentRoot\ndirective:\nDocumentRoot /path/to/rails/application/public\nNext, change the\n<Directory\n\"/path/to/rails/application/public\">\ndirective:\n<Directory \"/path/to/rails/application/public\">\n        Options Indexes FollowSymLinks MultiViews ExecCGI\n        AllowOverride All\n        Order allow,deny\n        allow from all\n        AddHandler cgi-script .cgi\n</Directory>\nYou should also enable the\nmod_rewrite\nmodule for Apache. To enable the\nmod_rewrite\nmodule, enter the following command into a terminal prompt:\nsudo\na2enmod\nrewrite\nFinally, you will need to change the ownership of the\n/path/to/rails/application/public\nand\n/path/to/rails/application/tmp\ndirectories to the user that will be used to run the Apache process:\nsudo\nchown\n-R\nwww-data:www-data\n/path/to/rails/application/public\nsudo\nchown\n-R\nwww-data:www-data\n/path/to/rails/application/tmp\nIf you need to compile your application assets run the following command in\nyour application directory:\nRAILS_ENV\n=\nproduction\nrake\nassets:precompile\nConfigure the database\n¶\nWith your database service in place, you need to make sure your app database configuration is also correct. For example, if you are using MySQL the your\nconfig/database.yml\nshould look like this:\n# Mysql \nproduction:\n  adapter: mysql2\n  username: user\n  password: password\n  host: 127.0.0.1 \n  database: app\nTo finally create your application database and apply its migrations you can run the following commands from your app directory:\nRAILS_ENV\n=\nproduction\nrake\ndb:create\nRAILS_ENV\n=\nproduction\nrake\ndb:migrate\nThat’s it! Now your Server is ready for your Ruby on Rails application. You can\ndaemonize\nyour application as you want.\nFurther reading\n¶\nSee the\nRuby on Rails\nwebsite for more information.\nAgile Development with Rails\nis also a great resource.", "meta": {"site": "documentation.ubuntu.com", "crawl_ts": "2025-11-27T10:38:36Z", "original_len_words": 458}}
{"id": "5d4c338f8c", "source_url": "https://documentation.ubuntu.com/server/how-to/web-services/use-apache2-modules/", "title": "How to use Apache2 modules - Ubuntu Server documentation", "text": "How to use Apache2 modules - Ubuntu Server documentation\nContents\nMenu\nExpand\nLight mode\nDark mode\nAuto light/dark, in light mode\nAuto light/dark, in dark mode\nSkip to content\nBack to top\nView this page\nHow to use Apache2 modules\n¶\nApache2 is a modular server. This implies that only the most basic functionality is included in the core server. Extended features are available through modules which can be loaded into Apache2.\nBy default, a base set of modules is included in the server at compile-time. If the server is compiled to use dynamically loaded modules, then modules can be compiled separately, and added at any time using the\nLoadModule\ndirective. Otherwise, Apache2 must be recompiled to add or remove modules.\nUbuntu compiles Apache2 to allow the dynamic loading of modules. Configuration directives may be conditionally included on the presence of a particular module by enclosing them in an\n<IfModule>\nblock.\nInstalling and handling modules\n¶\nYou can install additional Apache2 modules and use them with your web server. For example, run the following command at a terminal prompt to install the Python 3 WSGI module:\nsudo\napt\ninstall\nlibapache2-mod-wsgi-py3\nThe installation will enable the module automatically, but we can disable it with\na2dismod\n:\nsudo\na2dismod\nwsgi\nsudo\nsystemctl\nrestart\napache2.service\nAnd then use the\na2enmod\nutility to re-enable it:\nsudo\na2enmod\nwsgi\nsudo\nsystemctl\nrestart\napache2.service\nSee the\n/etc/apache2/mods-available\ndirectory for additional modules already available on your system.\nConfigure Apache2 for HTTPS\n¶\nThe\nmod_ssl\nmodule adds an important feature to the Apache2 server - the ability to encrypt communications. Thus, when your browser is communicating using SSL, the\nhttps://\nprefix is used at the beginning of the Uniform Resource Locator (URL) in the browser navigation bar.\nThe\nmod_ssl\nmodule is available in the\napache2-common\npackage. Run the following command at a terminal prompt to enable the\nmod_ssl\nmodule:\nsudo\na2enmod\nssl\nThere is a default HTTPS configuration file in\n/etc/apache2/sites-available/default-ssl.conf\n. In order for Apache2 to provide HTTPS, a\ncertificate\nand\nkey\nfile are also needed. The default HTTPS configuration will use a certificate and key generated by the\nssl-cert\npackage. They are good for testing, but the auto-generated certificate and key should be replaced by a certificate specific to the site or server.\nNote\nFor more information on generating a key and obtaining a certificate see\nCertificates\n.\nTo configure Apache2 for HTTPS, enter the following:\nsudo\na2ensite\ndefault-ssl\nNote\nThe directories\n/etc/ssl/certs\nand\n/etc/ssl/private\nare the default locations. If you install the certificate and key in another directory make sure to change\nSSLCertificateFile\nand\nSSLCertificateKeyFile\nappropriately.\nWith Apache2 now configured for HTTPS, restart the service to enable the new settings:\nsudo\nsystemctl\nrestart\napache2.service\nNote that depending on how you obtained your certificate, you may need to enter a passphrase when Apache2 restarts.\nYou can access the secure server pages by typing\nhttps://your_hostname/url/\nin your browser address bar.\nSharing write permission\n¶\nFor more than one user to be able to write to the same directory you will need to grant write permission to a group they share in common. The following example grants shared write permission to\n/var/www/html\nto the group “webmasters”.\nsudo\nchgrp\n-R\nwebmasters\n/var/www/html\nsudo\nchmod\n-R\ng\n=\nrwX\n/var/www/html/\nThese commands recursively set the group permission on all files and directories in\n/var/www/html\nto allow reading, writing and searching of directories. Many admins find this useful for allowing multiple users to edit files in a directory tree.\nWarning\nThe\napache2\ndaemon will run as the\nwww-data\nuser, which has a corresponding\nwww-data\ngroup. These\nshould not\nbe granted write access to the document root, as this would mean that vulnerabilities in Apache or the applications it is serving would allow attackers to overwrite the served content.\nFurther reading\n¶\nThe\nApache2 Documentation\ncontains in depth information on Apache2 configuration directives. Also, see the apache2-doc package for the official Apache2 docs.\nO’Reilly’s\nApache Cookbook\nis a good resource for accomplishing specific Apache2 configurations.\nFor Ubuntu specific Apache2 questions, ask in the\n#ubuntu-server\nIRC channel on\nlibera.chat\n.", "meta": {"site": "documentation.ubuntu.com", "crawl_ts": "2025-11-27T10:38:37Z", "original_len_words": 677}}
{"id": "58e6810c06", "source_url": "https://documentation.ubuntu.com/server/how-to/web-services/use-nginx-modules/", "title": "How to use nginx modules - Ubuntu Server documentation", "text": "How to use nginx modules - Ubuntu Server documentation\nContents\nMenu\nExpand\nLight mode\nDark mode\nAuto light/dark, in light mode\nAuto light/dark, in dark mode\nSkip to content\nBack to top\nView this page\nHow to use nginx modules\n¶\nLike other web servers, nginx supports dynamically loaded modules to provide in-server support for programming languages, security mechanisms, and so on. Ubuntu provides a number of these modules as separate packages that are either installed simultaneously with nginx, or can be installed separately.\nAvailable modules\n¶\nnginx will report the modules it has been built with via its\n-V\noption.  A quick and dirty way to list the available modules is thus:\n$\nnginx\n-V\n2\n>\n&\n1\n|\ntr\n--\n-\n'\\n'\n|\ngrep\n_module\nhttp_ssl_module\nhttp_stub_status_module\nhttp_realip_module\n...\nhttp_image_filter_module\n=\ndynamic\nhttp_perl_module\n=\ndynamic\nhttp_xslt_module\n=\ndynamic\nstream_geoip_module\n=\ndynamic\nMany of these modules are built-in and thus are always available with nginx, but some exist as separate packages whose installation status can be checked via\napt\n. For example:\n$\napt\npolicy\nlibnginx-mod-http-image-filter\nlibnginx-mod-http-image-filter:\nInstalled:\n(\nnone\n)\nCandidate:\n1\n.24.0-1ubuntu1\nVersion\ntable:\n1\n.24.0-1ubuntu1\n500\n500\nhttp://archive.ubuntu.com/ubuntu\nmantic/main\namd64\nPackages\napt\ncan also be used to install the desired dynamic module:\n$\nsudo\napt\ninstall\nlibnginx-mod-http-image-filter\n...\nThe\nfollowing\nNEW\npackages\nwill\nbe\ninstalled:\nlibnginx-mod-http-image-filter\n0\nupgraded,\n1\nnewly\ninstalled,\n0\nto\nremove\nand\n34\nnot\nupgraded.\n...\nTriggering\nnginx\nreload\n...\nEnabling and disabling dynamic modules\n¶\nDynamic modules are automatically enabled and get reloaded by nginx on installation. If you need to manually disable an installed module, remove its file from the\n/etc/nginx/modules-enabled\ndirectory, for example:\n$\nls\n/etc/nginx/modules-*\n/etc/nginx/modules-available:\n/etc/nginx/modules-enabled:\n50\n-mod-http-image-filter.conf\n\n$\nsudo\nmv\n/etc/nginx/modules-enabled/50-mod-http-image-filter.conf\n/etc/nginx/modules-available/\n\n$\nservice\nnginx\nrestart\nNote that built-in modules cannot be disabled/enabled.\nConfiguring modules\n¶\nThe installed configuration file for an nginx module mainly consists of the dynamically-loaded binary library:\n## /etc/nginx/modules-enabled/50-mod-http-image-filter.conf\nload_module modules/ngx_http_image_filter_module.so;\nNote that you can also use the\nload_module\nparameter in your\n/etc/nginx/nginx.conf\nat the top level, if preferred for some reason.\nTo use a module for your website, its settings are specified in your server block. For example:\nlocation /img/ {\n    image_filter resize 240 360;\n    image_filter rotate 180;\n    image_filter_buffer 16M;\n    error_page   415 = /415.html;\n}\nFurther reading\n¶\nYou’ve completed the nginx guide! See the following resources for more in-depth information on further extending nginx’s capabilities:\nThe\nnginx documentation\nprovides detailed explanations of configuration directives.\nO’Reilly’s nginx cookbook provides guidance on solving specific needs.\nFor Ubuntu-specific nginx questions, ask in the\n#ubuntu-server\nIRC channel on\nlibera.chat\n.", "meta": {"site": "documentation.ubuntu.com", "crawl_ts": "2025-11-27T10:38:37Z", "original_len_words": 426}}
